alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* ------------------------  SDMMC_FORCE_EVENT_ERR_STATUS  ------------------------ */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_TIMEOUT_ERR_Pos (0UL)       /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_TIMEOUT_ERR (Bit 0)    */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_TIMEOUT_ERR_Msk (0x1UL)     /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_TIMEOUT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_CRC_ERR_Pos (1UL)           /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_CRC_ERR (Bit 1)        */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_CRC_ERR_Msk (0x2UL)         /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_CRC_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_END_BIT_ERR_Pos (2UL)       /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_END_BIT_ERR (Bit 2)    */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_END_BIT_ERR_Msk (0x4UL)     /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_END_BIT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_IND_ERR_Pos (3UL)           /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_IND_ERR (Bit 3)        */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CMD_IND_ERR_Msk (0x8UL)         /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CMD_IND_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_TIMEOUT_ERR_Pos (4UL)      /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_TIMEOUT_ERR (Bit 4)   */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_TIMEOUT_ERR_Msk (0x10UL)   /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_TIMEOUT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_CRC_ERR_Pos (5UL)          /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_CRC_ERR (Bit 5)       */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_CRC_ERR_Msk (0x20UL)       /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_CRC_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_END_BIT_ERR_Pos (6UL)      /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_END_BIT_ERR (Bit 6)   */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_DATA_END_BIT_ERR_Msk (0x40UL)   /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_DATA_END_BIT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CURRENT_LIMIT_ERR_Pos (7UL)     /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CURRENT_LIMIT_ERR (Bit 7)  */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CURRENT_LIMIT_ERR_Msk (0x80UL)  /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CURRENT_LIMIT_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_ACMD12_ERR_Pos (8UL)            /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_ACMD12_ERR (Bit 8)         */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_ACMD12_ERR_Msk (0x100UL)        /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_ACMD12_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_TARGET_RESPONSE_ERR_Pos (12UL)  /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_TARGET_RESPONSE_ERR (Bit 12) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_TARGET_RESPONSE_ERR_Msk (0x1000UL) /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_TARGET_RESPONSE_ERR (Bitfield-Mask: 0x01) */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CEATA_ERR_Pos (13UL)            /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CEATA_ERR (Bit 13)         */
#define SDMMC_FORCE_EVENT_ERR_STATUS_FE_CEATA_ERR_Msk (0x2000UL)        /*!< SDMMC FORCE_EVENT_ERR_STATUS: FE_CEATA_ERR (Bitfield-Mask: 0x01) */

/* -------------------------------  SDMMC_DEBUG_SEL  ------------------------------ */
#define SDMMC_DEBUG_SEL_DEBUG_SEL_Pos         (0UL)                     /*!< SDMMC DEBUG_SEL: DEBUG_SEL (Bit 0)                          */
#define SDMMC_DEBUG_SEL_DEBUG_SEL_Msk         (0x1UL)                   /*!< SDMMC DEBUG_SEL: DEBUG_SEL (Bitfield-Mask: 0x01)            */

/* ----------------------------  SDMMC_SLOT_INT_STATUS  --------------------------- */
#define SDMMC_SLOT_INT_STATUS_SLOT_INT_STATUS_Pos (0UL)                 /*!< SDMMC SLOT_INT_STATUS: SLOT_INT_STATUS (Bit 0)              */
#define SDMMC_SLOT_INT_STATUS_SLOT_INT_STATUS_Msk (0xffUL)              /*!< SDMMC SLOT_INT_STATUS: SLOT_INT_STATUS (Bitfield-Mask: 0xff) */


/* ================================================================================ */
/* ================          struct 'EBU' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  EBU_CLC  ---------------------------------- */
#define EBU_CLC_DISR_Pos                      (0UL)                     /*!< EBU CLC: DISR (Bit 0)                                       */
#define EBU_CLC_DISR_Msk                      (0x1UL)                   /*!< EBU CLC: DISR (Bitfield-Mask: 0x01)                         */
#define EBU_CLC_DISS_Pos                      (1UL)                     /*!< EBU CLC: DISS (Bit 1)                                       */
#define EBU_CLC_DISS_Msk                      (0x2UL)                   /*!< EBU CLC: DISS (Bitfield-Mask: 0x01)                         */
#define EBU_CLC_SYNC_Pos                      (16UL)                    /*!< EBU CLC: SYNC (Bit 16)                                      */
#define EBU_CLC_SYNC_Msk                      (0x10000UL)               /*!< EBU CLC: SYNC (Bitfield-Mask: 0x01)                         */
#define EBU_CLC_DIV2_Pos                      (17UL)                    /*!< EBU CLC: DIV2 (Bit 17)                                      */
#define EBU_CLC_DIV2_Msk                      (0x20000UL)               /*!< EBU CLC: DIV2 (Bitfield-Mask: 0x01)                         */
#define EBU_CLC_EBUDIV_Pos                    (18UL)                    /*!< EBU CLC: EBUDIV (Bit 18)                                    */
#define EBU_CLC_EBUDIV_Msk                    (0xc0000UL)               /*!< EBU CLC: EBUDIV (Bitfield-Mask: 0x03)                       */
#define EBU_CLC_SYNCACK_Pos                   (20UL)                    /*!< EBU CLC: SYNCACK (Bit 20)                                   */
#define EBU_CLC_SYNCACK_Msk                   (0x100000UL)              /*!< EBU CLC: SYNCACK (Bitfield-Mask: 0x01)                      */
#define EBU_CLC_DIV2ACK_Pos                   (21UL)                    /*!< EBU CLC: DIV2ACK (Bit 21)                                   */
#define EBU_CLC_DIV2ACK_Msk                   (0x200000UL)              /*!< EBU CLC: DIV2ACK (Bitfield-Mask: 0x01)                      */
#define EBU_CLC_EBUDIVACK_Pos                 (22UL)                    /*!< EBU CLC: EBUDIVACK (Bit 22)                                 */
#define EBU_CLC_EBUDIVACK_Msk                 (0xc00000UL)              /*!< EBU CLC: EBUDIVACK (Bitfield-Mask: 0x03)                    */

/* ---------------------------------  EBU_MODCON  --------------------------------- */
#define EBU_MODCON_STS_Pos                    (0UL)                     /*!< EBU MODCON: STS (Bit 0)                                     */
#define EBU_MODCON_STS_Msk                    (0x1UL)                   /*!< EBU MODCON: STS (Bitfield-Mask: 0x01)                       */
#define EBU_MODCON_LCKABRT_Pos                (1UL)                     /*!< EBU MODCON: LCKABRT (Bit 1)                                 */
#define EBU_MODCON_LCKABRT_Msk                (0x2UL)                   /*!< EBU MODCON: LCKABRT (Bitfield-Mask: 0x01)                   */
#define EBU_MODCON_SDTRI_Pos                  (2UL)                     /*!< EBU MODCON: SDTRI (Bit 2)                                   */
#define EBU_MODCON_SDTRI_Msk                  (0x4UL)                   /*!< EBU MODCON: SDTRI (Bitfield-Mask: 0x01)                     */
#define EBU_MODCON_EXTLOCK_Pos                (4UL)                     /*!< EBU MODCON: EXTLOCK (Bit 4)                                 */
#define EBU_MODCON_EXTLOCK_Msk                (0x10UL)                  /*!< EBU MODCON: EXTLOCK (Bitfield-Mask: 0x01)                   */
#define EBU_MODCON_ARBSYNC_Pos                (5UL)                     /*!< EBU MODCON: ARBSYNC (Bit 5)                                 */
#define EBU_MODCON_ARBSYNC_Msk                (0x20UL)                  /*!< EBU MODCON: ARBSYNC (Bitfield-Mask: 0x01)                   */
#define EBU_MODCON_ARBMODE_Pos                (6UL)                     /*!< EBU MODCON: ARBMODE (Bit 6)                                 */
#define EBU_MODCON_ARBMODE_Msk                (0xc0UL)                  /*!< EBU MODCON: ARBMODE (Bitfield-Mask: 0x03)                   */
#define EBU_MODCON_TIMEOUTC_Pos               (8UL)                     /*!< EBU MODCON: TIMEOUTC (Bit 8)                                */
#define EBU_MODCON_TIMEOUTC_Msk               (0xff00UL)                /*!< EBU MODCON: TIMEOUTC (Bitfield-Mask: 0xff)                  */
#define EBU_MODCON_LOCKTIMEOUT_Pos            (16UL)                    /*!< EBU MODCON: LOCKTIMEOUT (Bit 16)                            */
#define EBU_MODCON_LOCKTIMEOUT_Msk            (0xff0000UL)              /*!< EBU MODCON: LOCKTIMEOUT (Bitfield-Mask: 0xff)               */
#define EBU_MODCON_GLOBALCS_Pos               (24UL)                    /*!< EBU MODCON: GLOBALCS (Bit 24)                               */
#define EBU_MODCON_GLOBALCS_Msk               (0xf000000UL)             /*!< EBU MODCON: GLOBALCS (Bitfield-Mask: 0x0f)                  */
#define EBU_MODCON_ACCSINH_Pos                (28UL)                    /*!< EBU MODCON: ACCSINH (Bit 28)                                */
#define EBU_MODCON_ACCSINH_Msk                (0x10000000UL)            /*!< EBU MODCON: ACCSINH (Bitfield-Mask: 0x01)                   */
#define EBU_MODCON_ACCSINHACK_Pos             (29UL)                    /*!< EBU MODCON: ACCSINHACK (Bit 29)                             */
#define EBU_MODCON_ACCSINHACK_Msk             (0x20000000UL)            /*!< EBU MODCON: ACCSINHACK (Bitfield-Mask: 0x01)                */
#define EBU_MODCON_ALE_Pos                    (31UL)                    /*!< EBU MODCON: ALE (Bit 31)                                    */
#define EBU_MODCON_ALE_Msk                    (0x80000000UL)            /*!< EBU MODCON: ALE (Bitfield-Mask: 0x01)                       */

/* -----------------------------------  EBU_ID  ----------------------------------- */
#define EBU_ID_MOD_REV_Pos                    (0UL)                     /*!< EBU ID: MOD_REV (Bit 0)                                     */
#define EBU_ID_MOD_REV_Msk                    (0xffUL)                  /*!< EBU ID: MOD_REV (Bitfield-Mask: 0xff)                       */
#define EBU_ID_MOD_TYPE_Pos                   (8UL)                     /*!< EBU ID: MOD_TYPE (Bit 8)                                    */
#define EBU_ID_MOD_TYPE_Msk                   (0xff00UL)                /*!< EBU ID: MOD_TYPE (Bitfield-Mask: 0xff)                      */
#define EBU_ID_MOD_NUMBER_Pos                 (16UL)                    /*!< EBU ID: MOD_NUMBER (Bit 16)                                 */
#define EBU_ID_MOD_NUMBER_Msk                 (0xffff0000UL)            /*!< EBU ID: MOD_NUMBER (Bitfield-Mask: 0xffff)                  */

/* ---------------------------------  EBU_USERCON  -------------------------------- */
#define EBU_USERCON_DIP_Pos                   (0UL)                     /*!< EBU USERCON: DIP (Bit 0)                                    */
#define EBU_USERCON_DIP_Msk                   (0x1UL)                   /*!< EBU USERCON: DIP (Bitfield-Mask: 0x01)                      */
#define EBU_USERCON_ADDIO_Pos                 (16UL)                    /*!< EBU USERCON: ADDIO (Bit 16)                                 */
#define EBU_USERCON_ADDIO_Msk                 (0x1ff0000UL)             /*!< EBU USERCON: ADDIO (Bitfield-Mask: 0x1ff)                   */
#define EBU_USERCON_ADVIO_Pos                 (25UL)                    /*!< EBU USERCON: ADVIO (Bit 25)                                 */
#define EBU_USERCON_ADVIO_Msk                 (0x2000000UL)             /*!< EBU USERCON: ADVIO (Bitfield-Mask: 0x01)                    */

/* --------------------------------  EBU_ADDRSEL0  -------------------------------- */
#define EBU_ADDRSEL0_REGENAB_Pos              (0UL)                     /*!< EBU ADDRSEL0: REGENAB (Bit 0)                               */
#define EBU_ADDRSEL0_REGENAB_Msk              (0x1UL)                   /*!< EBU ADDRSEL0: REGENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL0_ALTENAB_Pos              (1UL)                     /*!< EBU ADDRSEL0: ALTENAB (Bit 1)                               */
#define EBU_ADDRSEL0_ALTENAB_Msk              (0x2UL)                   /*!< EBU ADDRSEL0: ALTENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL0_WPROT_Pos                (2UL)                     /*!< EBU ADDRSEL0: WPROT (Bit 2)                                 */
#define EBU_ADDRSEL0_WPROT_Msk                (0x4UL)                   /*!< EBU ADDRSEL0: WPROT (Bitfield-Mask: 0x01)                   */

/* --------------------------------  EBU_ADDRSEL1  -------------------------------- */
#define EBU_ADDRSEL1_REGENAB_Pos              (0UL)                     /*!< EBU ADDRSEL1: REGENAB (Bit 0)                               */
#define EBU_ADDRSEL1_REGENAB_Msk              (0x1UL)                   /*!< EBU ADDRSEL1: REGENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL1_ALTENAB_Pos              (1UL)                     /*!< EBU ADDRSEL1: ALTENAB (Bit 1)                               */
#define EBU_ADDRSEL1_ALTENAB_Msk              (0x2UL)                   /*!< EBU ADDRSEL1: ALTENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL1_WPROT_Pos                (2UL)                     /*!< EBU ADDRSEL1: WPROT (Bit 2)                                 */
#define EBU_ADDRSEL1_WPROT_Msk                (0x4UL)                   /*!< EBU ADDRSEL1: WPROT (Bitfield-Mask: 0x01)                   */

