alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* --------------------------------  EBU_ADDRSEL2  -------------------------------- */
#define EBU_ADDRSEL2_REGENAB_Pos              (0UL)                     /*!< EBU ADDRSEL2: REGENAB (Bit 0)                               */
#define EBU_ADDRSEL2_REGENAB_Msk              (0x1UL)                   /*!< EBU ADDRSEL2: REGENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL2_ALTENAB_Pos              (1UL)                     /*!< EBU ADDRSEL2: ALTENAB (Bit 1)                               */
#define EBU_ADDRSEL2_ALTENAB_Msk              (0x2UL)                   /*!< EBU ADDRSEL2: ALTENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL2_WPROT_Pos                (2UL)                     /*!< EBU ADDRSEL2: WPROT (Bit 2)                                 */
#define EBU_ADDRSEL2_WPROT_Msk                (0x4UL)                   /*!< EBU ADDRSEL2: WPROT (Bitfield-Mask: 0x01)                   */

/* --------------------------------  EBU_ADDRSEL3  -------------------------------- */
#define EBU_ADDRSEL3_REGENAB_Pos              (0UL)                     /*!< EBU ADDRSEL3: REGENAB (Bit 0)                               */
#define EBU_ADDRSEL3_REGENAB_Msk              (0x1UL)                   /*!< EBU ADDRSEL3: REGENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL3_ALTENAB_Pos              (1UL)                     /*!< EBU ADDRSEL3: ALTENAB (Bit 1)                               */
#define EBU_ADDRSEL3_ALTENAB_Msk              (0x2UL)                   /*!< EBU ADDRSEL3: ALTENAB (Bitfield-Mask: 0x01)                 */
#define EBU_ADDRSEL3_WPROT_Pos                (2UL)                     /*!< EBU ADDRSEL3: WPROT (Bit 2)                                 */
#define EBU_ADDRSEL3_WPROT_Msk                (0x4UL)                   /*!< EBU ADDRSEL3: WPROT (Bitfield-Mask: 0x01)                   */

/* --------------------------------  EBU_BUSRCON0  -------------------------------- */
#define EBU_BUSRCON0_FETBLEN_Pos              (0UL)                     /*!< EBU BUSRCON0: FETBLEN (Bit 0)                               */
#define EBU_BUSRCON0_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSRCON0: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRCON0_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSRCON0: FBBMSEL (Bit 3)                               */
#define EBU_BUSRCON0_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSRCON0: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON0_BFSSS_Pos                (4UL)                     /*!< EBU BUSRCON0: BFSSS (Bit 4)                                 */
#define EBU_BUSRCON0_BFSSS_Msk                (0x10UL)                  /*!< EBU BUSRCON0: BFSSS (Bitfield-Mask: 0x01)                   */
#define EBU_BUSRCON0_FDBKEN_Pos               (5UL)                     /*!< EBU BUSRCON0: FDBKEN (Bit 5)                                */
#define EBU_BUSRCON0_FDBKEN_Msk               (0x20UL)                  /*!< EBU BUSRCON0: FDBKEN (Bitfield-Mask: 0x01)                  */
#define EBU_BUSRCON0_BFCMSEL_Pos              (6UL)                     /*!< EBU BUSRCON0: BFCMSEL (Bit 6)                               */
#define EBU_BUSRCON0_BFCMSEL_Msk              (0x40UL)                  /*!< EBU BUSRCON0: BFCMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON0_NAA_Pos                  (7UL)                     /*!< EBU BUSRCON0: NAA (Bit 7)                                   */
#define EBU_BUSRCON0_NAA_Msk                  (0x80UL)                  /*!< EBU BUSRCON0: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON0_ECSE_Pos                 (16UL)                    /*!< EBU BUSRCON0: ECSE (Bit 16)                                 */
#define EBU_BUSRCON0_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSRCON0: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON0_EBSE_Pos                 (17UL)                    /*!< EBU BUSRCON0: EBSE (Bit 17)                                 */
#define EBU_BUSRCON0_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSRCON0: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON0_DBA_Pos                  (18UL)                    /*!< EBU BUSRCON0: DBA (Bit 18)                                  */
#define EBU_BUSRCON0_DBA_Msk                  (0x40000UL)               /*!< EBU BUSRCON0: DBA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON0_WAITINV_Pos              (19UL)                    /*!< EBU BUSRCON0: WAITINV (Bit 19)                              */
#define EBU_BUSRCON0_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSRCON0: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON0_BCGEN_Pos                (20UL)                    /*!< EBU BUSRCON0: BCGEN (Bit 20)                                */
#define EBU_BUSRCON0_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSRCON0: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON0_PORTW_Pos                (22UL)                    /*!< EBU BUSRCON0: PORTW (Bit 22)                                */
#define EBU_BUSRCON0_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSRCON0: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON0_WAIT_Pos                 (24UL)                    /*!< EBU BUSRCON0: WAIT (Bit 24)                                 */
#define EBU_BUSRCON0_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSRCON0: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSRCON0_AAP_Pos                  (26UL)                    /*!< EBU BUSRCON0: AAP (Bit 26)                                  */
#define EBU_BUSRCON0_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSRCON0: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON0_AGEN_Pos                 (28UL)                    /*!< EBU BUSRCON0: AGEN (Bit 28)                                 */
#define EBU_BUSRCON0_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSRCON0: AGEN (Bitfield-Mask: 0x0f)                    */

