alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* ---------------------------------  EBU_BUSRAP0  -------------------------------- */
#define EBU_BUSRAP0_RDDTACS_Pos               (0UL)                     /*!< EBU BUSRAP0: RDDTACS (Bit 0)                                */
#define EBU_BUSRAP0_RDDTACS_Msk               (0xfUL)                   /*!< EBU BUSRAP0: RDDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSRAP0_RDRECOVC_Pos              (4UL)                     /*!< EBU BUSRAP0: RDRECOVC (Bit 4)                               */
#define EBU_BUSRAP0_RDRECOVC_Msk              (0x70UL)                  /*!< EBU BUSRAP0: RDRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRAP0_WAITRDC_Pos               (7UL)                     /*!< EBU BUSRAP0: WAITRDC (Bit 7)                                */
#define EBU_BUSRAP0_WAITRDC_Msk               (0xf80UL)                 /*!< EBU BUSRAP0: WAITRDC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSRAP0_DATAC_Pos                 (12UL)                    /*!< EBU BUSRAP0: DATAC (Bit 12)                                 */
#define EBU_BUSRAP0_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSRAP0: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSRAP0_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSRAP0: EXTCLOCK (Bit 16)                              */
#define EBU_BUSRAP0_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSRAP0: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSRAP0_EXTDATA_Pos               (18UL)                    /*!< EBU BUSRAP0: EXTDATA (Bit 18)                               */
#define EBU_BUSRAP0_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSRAP0: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSRAP0_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSRAP0: CMDDELAY (Bit 20)                              */
#define EBU_BUSRAP0_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSRAP0: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSRAP0_AHOLDC_Pos                (24UL)                    /*!< EBU BUSRAP0: AHOLDC (Bit 24)                                */
#define EBU_BUSRAP0_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSRAP0: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSRAP0_ADDRC_Pos                 (28UL)                    /*!< EBU BUSRAP0: ADDRC (Bit 28)                                 */
#define EBU_BUSRAP0_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSRAP0: ADDRC (Bitfield-Mask: 0x0f)                    */

/* --------------------------------  EBU_BUSWCON0  -------------------------------- */
#define EBU_BUSWCON0_FETBLEN_Pos              (0UL)                     /*!< EBU BUSWCON0: FETBLEN (Bit 0)                               */
#define EBU_BUSWCON0_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSWCON0: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWCON0_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSWCON0: FBBMSEL (Bit 3)                               */
#define EBU_BUSWCON0_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSWCON0: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON0_NAA_Pos                  (7UL)                     /*!< EBU BUSWCON0: NAA (Bit 7)                                   */
#define EBU_BUSWCON0_NAA_Msk                  (0x80UL)                  /*!< EBU BUSWCON0: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON0_ECSE_Pos                 (16UL)                    /*!< EBU BUSWCON0: ECSE (Bit 16)                                 */
#define EBU_BUSWCON0_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSWCON0: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON0_EBSE_Pos                 (17UL)                    /*!< EBU BUSWCON0: EBSE (Bit 17)                                 */
#define EBU_BUSWCON0_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSWCON0: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON0_WAITINV_Pos              (19UL)                    /*!< EBU BUSWCON0: WAITINV (Bit 19)                              */
#define EBU_BUSWCON0_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSWCON0: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON0_BCGEN_Pos                (20UL)                    /*!< EBU BUSWCON0: BCGEN (Bit 20)                                */
#define EBU_BUSWCON0_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSWCON0: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON0_PORTW_Pos                (22UL)                    /*!< EBU BUSWCON0: PORTW (Bit 22)                                */
#define EBU_BUSWCON0_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSWCON0: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON0_WAIT_Pos                 (24UL)                    /*!< EBU BUSWCON0: WAIT (Bit 24)                                 */
#define EBU_BUSWCON0_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSWCON0: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSWCON0_AAP_Pos                  (26UL)                    /*!< EBU BUSWCON0: AAP (Bit 26)                                  */
#define EBU_BUSWCON0_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSWCON0: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON0_LOCKCS_Pos               (27UL)                    /*!< EBU BUSWCON0: LOCKCS (Bit 27)                               */
#define EBU_BUSWCON0_LOCKCS_Msk               (0x8000000UL)             /*!< EBU BUSWCON0: LOCKCS (Bitfield-Mask: 0x01)                  */
#define EBU_BUSWCON0_AGEN_Pos                 (28UL)                    /*!< EBU BUSWCON0: AGEN (Bit 28)                                 */
#define EBU_BUSWCON0_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSWCON0: AGEN (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  EBU_BUSWAP0  -------------------------------- */
#define EBU_BUSWAP0_WRDTACS_Pos               (0UL)                     /*!< EBU BUSWAP0: WRDTACS (Bit 0)                                */
#define EBU_BUSWAP0_WRDTACS_Msk               (0xfUL)                   /*!< EBU BUSWAP0: WRDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSWAP0_WRRECOVC_Pos              (4UL)                     /*!< EBU BUSWAP0: WRRECOVC (Bit 4)                               */
#define EBU_BUSWAP0_WRRECOVC_Msk              (0x70UL)                  /*!< EBU BUSWAP0: WRRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWAP0_WAITWRC_Pos               (7UL)                     /*!< EBU BUSWAP0: WAITWRC (Bit 7)                                */
#define EBU_BUSWAP0_WAITWRC_Msk               (0xf80UL)                 /*!< EBU BUSWAP0: WAITWRC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSWAP0_DATAC_Pos                 (12UL)                    /*!< EBU BUSWAP0: DATAC (Bit 12)                                 */
#define EBU_BUSWAP0_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSWAP0: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSWAP0_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSWAP0: EXTCLOCK (Bit 16)                              */
#define EBU_BUSWAP0_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSWAP0: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSWAP0_EXTDATA_Pos               (18UL)                    /*!< EBU BUSWAP0: EXTDATA (Bit 18)                               */
#define EBU_BUSWAP0_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSWAP0: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSWAP0_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSWAP0: CMDDELAY (Bit 20)                              */
#define EBU_BUSWAP0_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSWAP0: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSWAP0_AHOLDC_Pos                (24UL)                    /*!< EBU BUSWAP0: AHOLDC (Bit 24)                                */
#define EBU_BUSWAP0_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSWAP0: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSWAP0_ADDRC_Pos                 (28UL)                    /*!< EBU BUSWAP0: ADDRC (Bit 28)                                 */
#define EBU_BUSWAP0_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSWAP0: ADDRC (Bitfield-Mask: 0x0f)                    */

/* --------------------------------  EBU_BUSRCON1  -------------------------------- */
#define EBU_BUSRCON1_FETBLEN_Pos              (0UL)                     /*!< EBU BUSRCON1: FETBLEN (Bit 0)                               */
#define EBU_BUSRCON1_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSRCON1: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRCON1_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSRCON1: FBBMSEL (Bit 3)                               */
#define EBU_BUSRCON1_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSRCON1: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON1_BFSSS_Pos                (4UL)                     /*!< EBU BUSRCON1: BFSSS (Bit 4)                                 */
#define EBU_BUSRCON1_BFSSS_Msk                (0x10UL)                  /*!< EBU BUSRCON1: BFSSS (Bitfield-Mask: 0x01)                   */
#define EBU_BUSRCON1_FDBKEN_Pos               (5UL)                     /*!< EBU BUSRCON1: FDBKEN (Bit 5)                                */
#define EBU_BUSRCON1_FDBKEN_Msk               (0x20UL)                  /*!< EBU BUSRCON1: FDBKEN (Bitfield-Mask: 0x01)                  */
#define EBU_BUSRCON1_BFCMSEL_Pos              (6UL)                     /*!< EBU BUSRCON1: BFCMSEL (Bit 6)                               */
#define EBU_BUSRCON1_BFCMSEL_Msk              (0x40UL)                  /*!< EBU BUSRCON1: BFCMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON1_NAA_Pos                  (7UL)                     /*!< EBU BUSRCON1: NAA (Bit 7)                                   */
#define EBU_BUSRCON1_NAA_Msk                  (0x80UL)                  /*!< EBU BUSRCON1: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON1_ECSE_Pos                 (16UL)                    /*!< EBU BUSRCON1: ECSE (Bit 16)                                 */
#define EBU_BUSRCON1_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSRCON1: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON1_EBSE_Pos                 (17UL)                    /*!< EBU BUSRCON1: EBSE (Bit 17)                                 */
#define EBU_BUSRCON1_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSRCON1: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSRCON1_DBA_Pos                  (18UL)                    /*!< EBU BUSRCON1: DBA (Bit 18)                                  */
#define EBU_BUSRCON1_DBA_Msk                  (0x40000UL)               /*!< EBU BUSRCON1: DBA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON1_WAITINV_Pos              (19UL)                    /*!< EBU BUSRCON1: WAITINV (Bit 19)                              */
#define EBU_BUSRCON1_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSRCON1: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSRCON1_BCGEN_Pos                (20UL)                    /*!< EBU BUSRCON1: BCGEN (Bit 20)                                */
#define EBU_BUSRCON1_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSRCON1: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON1_PORTW_Pos                (22UL)                    /*!< EBU BUSRCON1: PORTW (Bit 22)                                */
#define EBU_BUSRCON1_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSRCON1: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSRCON1_WAIT_Pos                 (24UL)                    /*!< EBU BUSRCON1: WAIT (Bit 24)                                 */
#define EBU_BUSRCON1_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSRCON1: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSRCON1_AAP_Pos                  (26UL)                    /*!< EBU BUSRCON1: AAP (Bit 26)                                  */
#define EBU_BUSRCON1_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSRCON1: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSRCON1_AGEN_Pos                 (28UL)                    /*!< EBU BUSRCON1: AGEN (Bit 28)                                 */
#define EBU_BUSRCON1_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSRCON1: AGEN (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  EBU_BUSRAP1  -------------------------------- */
#define EBU_BUSRAP1_RDDTACS_Pos               (0UL)                     /*!< EBU BUSRAP1: RDDTACS (Bit 0)                                */
#define EBU_BUSRAP1_RDDTACS_Msk               (0xfUL)                   /*!< EBU BUSRAP1: RDDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSRAP1_RDRECOVC_Pos              (4UL)                     /*!< EBU BUSRAP1: RDRECOVC (Bit 4)                               */
#define EBU_BUSRAP1_RDRECOVC_Msk              (0x70UL)                  /*!< EBU BUSRAP1: RDRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSRAP1_WAITRDC_Pos               (7UL)                     /*!< EBU BUSRAP1: WAITRDC (Bit 7)                                */
#define EBU_BUSRAP1_WAITRDC_Msk               (0xf80UL)                 /*!< EBU BUSRAP1: WAITRDC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSRAP1_DATAC_Pos                 (12UL)                    /*!< EBU BUSRAP1: DATAC (Bit 12)                                 */
#define EBU_BUSRAP1_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSRAP1: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSRAP1_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSRAP1: EXTCLOCK (Bit 16)                              */
#define EBU_BUSRAP1_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSRAP1: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSRAP1_EXTDATA_Pos               (18UL)                    /*!< EBU BUSRAP1: EXTDATA (Bit 18)                               */
#define EBU_BUSRAP1_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSRAP1: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSRAP1_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSRAP1: CMDDELAY (Bit 20)                              */
#define EBU_BUSRAP1_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSRAP1: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSRAP1_AHOLDC_Pos                (24UL)                    /*!< EBU BUSRAP1: AHOLDC (Bit 24)                                */
#define EBU_BUSRAP1_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSRAP1: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSRAP1_ADDRC_Pos                 (28UL)                    /*!< EBU BUSRAP1: ADDRC (Bit 28)                                 */
#define EBU_BUSRAP1_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSRAP1: ADDRC (Bitfield-Mask: 0x0f)                    */

/* --------------------------------  EBU_BUSWCON1  -------------------------------- */
#define EBU_BUSWCON1_FETBLEN_Pos              (0UL)                     /*!< EBU BUSWCON1: FETBLEN (Bit 0)                               */
#define EBU_BUSWCON1_FETBLEN_Msk              (0x7UL)                   /*!< EBU BUSWCON1: FETBLEN (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWCON1_FBBMSEL_Pos              (3UL)                     /*!< EBU BUSWCON1: FBBMSEL (Bit 3)                               */
#define EBU_BUSWCON1_FBBMSEL_Msk              (0x8UL)                   /*!< EBU BUSWCON1: FBBMSEL (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON1_NAA_Pos                  (7UL)                     /*!< EBU BUSWCON1: NAA (Bit 7)                                   */
#define EBU_BUSWCON1_NAA_Msk                  (0x80UL)                  /*!< EBU BUSWCON1: NAA (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON1_ECSE_Pos                 (16UL)                    /*!< EBU BUSWCON1: ECSE (Bit 16)                                 */
#define EBU_BUSWCON1_ECSE_Msk                 (0x10000UL)               /*!< EBU BUSWCON1: ECSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON1_EBSE_Pos                 (17UL)                    /*!< EBU BUSWCON1: EBSE (Bit 17)                                 */
#define EBU_BUSWCON1_EBSE_Msk                 (0x20000UL)               /*!< EBU BUSWCON1: EBSE (Bitfield-Mask: 0x01)                    */
#define EBU_BUSWCON1_WAITINV_Pos              (19UL)                    /*!< EBU BUSWCON1: WAITINV (Bit 19)                              */
#define EBU_BUSWCON1_WAITINV_Msk              (0x80000UL)               /*!< EBU BUSWCON1: WAITINV (Bitfield-Mask: 0x01)                 */
#define EBU_BUSWCON1_BCGEN_Pos                (20UL)                    /*!< EBU BUSWCON1: BCGEN (Bit 20)                                */
#define EBU_BUSWCON1_BCGEN_Msk                (0x300000UL)              /*!< EBU BUSWCON1: BCGEN (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON1_PORTW_Pos                (22UL)                    /*!< EBU BUSWCON1: PORTW (Bit 22)                                */
#define EBU_BUSWCON1_PORTW_Msk                (0xc00000UL)              /*!< EBU BUSWCON1: PORTW (Bitfield-Mask: 0x03)                   */
#define EBU_BUSWCON1_WAIT_Pos                 (24UL)                    /*!< EBU BUSWCON1: WAIT (Bit 24)                                 */
#define EBU_BUSWCON1_WAIT_Msk                 (0x3000000UL)             /*!< EBU BUSWCON1: WAIT (Bitfield-Mask: 0x03)                    */
#define EBU_BUSWCON1_AAP_Pos                  (26UL)                    /*!< EBU BUSWCON1: AAP (Bit 26)                                  */
#define EBU_BUSWCON1_AAP_Msk                  (0x4000000UL)             /*!< EBU BUSWCON1: AAP (Bitfield-Mask: 0x01)                     */
#define EBU_BUSWCON1_LOCKCS_Pos               (27UL)                    /*!< EBU BUSWCON1: LOCKCS (Bit 27)                               */
#define EBU_BUSWCON1_LOCKCS_Msk               (0x8000000UL)             /*!< EBU BUSWCON1: LOCKCS (Bitfield-Mask: 0x01)                  */
#define EBU_BUSWCON1_AGEN_Pos                 (28UL)                    /*!< EBU BUSWCON1: AGEN (Bit 28)                                 */
#define EBU_BUSWCON1_AGEN_Msk                 (0xf0000000UL)            /*!< EBU BUSWCON1: AGEN (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  EBU_BUSWAP1  -------------------------------- */
#define EBU_BUSWAP1_WRDTACS_Pos               (0UL)                     /*!< EBU BUSWAP1: WRDTACS (Bit 0)                                */
#define EBU_BUSWAP1_WRDTACS_Msk               (0xfUL)                   /*!< EBU BUSWAP1: WRDTACS (Bitfield-Mask: 0x0f)                  */
#define EBU_BUSWAP1_WRRECOVC_Pos              (4UL)                     /*!< EBU BUSWAP1: WRRECOVC (Bit 4)                               */
#define EBU_BUSWAP1_WRRECOVC_Msk              (0x70UL)                  /*!< EBU BUSWAP1: WRRECOVC (Bitfield-Mask: 0x07)                 */
#define EBU_BUSWAP1_WAITWRC_Pos               (7UL)                     /*!< EBU BUSWAP1: WAITWRC (Bit 7)                                */
#define EBU_BUSWAP1_WAITWRC_Msk               (0xf80UL)                 /*!< EBU BUSWAP1: WAITWRC (Bitfield-Mask: 0x1f)                  */
#define EBU_BUSWAP1_DATAC_Pos                 (12UL)                    /*!< EBU BUSWAP1: DATAC (Bit 12)                                 */
#define EBU_BUSWAP1_DATAC_Msk                 (0xf000UL)                /*!< EBU BUSWAP1: DATAC (Bitfield-Mask: 0x0f)                    */
#define EBU_BUSWAP1_EXTCLOCK_Pos              (16UL)                    /*!< EBU BUSWAP1: EXTCLOCK (Bit 16)                              */
#define EBU_BUSWAP1_EXTCLOCK_Msk              (0x30000UL)               /*!< EBU BUSWAP1: EXTCLOCK (Bitfield-Mask: 0x03)                 */
#define EBU_BUSWAP1_EXTDATA_Pos               (18UL)                    /*!< EBU BUSWAP1: EXTDATA (Bit 18)                               */
#define EBU_BUSWAP1_EXTDATA_Msk               (0xc0000UL)               /*!< EBU BUSWAP1: EXTDATA (Bitfield-Mask: 0x03)                  */
#define EBU_BUSWAP1_CMDDELAY_Pos              (20UL)                    /*!< EBU BUSWAP1: CMDDELAY (Bit 20)                              */
#define EBU_BUSWAP1_CMDDELAY_Msk              (0xf00000UL)              /*!< EBU BUSWAP1: CMDDELAY (Bitfield-Mask: 0x0f)                 */
#define EBU_BUSWAP1_AHOLDC_Pos                (24UL)                    /*!< EBU BUSWAP1: AHOLDC (Bit 24)                                */
#define EBU_BUSWAP1_AHOLDC_Msk                (0xf000000UL)             /*!< EBU BUSWAP1: AHOLDC (Bitfield-Mask: 0x0f)                   */
#define EBU_BUSWAP1_ADDRC_Pos                 (28UL)                    /*!< EBU BUSWAP1: ADDRC (Bit 28)                                 */
#define EBU_BUSWAP1_ADDRC_Msk                 (0xf0000000UL)            /*!< EBU BUSWAP1: ADDRC (Bitfield-Mask: 0x0f)                    */

