alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* --------------------  ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER  -------------------- */
#define ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_Pos (0UL)             /*!< ETH RECEIVE_INTERRUPT_WATCHDOG_TIMER: RIWT (Bit 0)          */
#define ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER_RIWT_Msk (0xffUL)          /*!< ETH RECEIVE_INTERRUPT_WATCHDOG_TIMER: RIWT (Bitfield-Mask: 0xff) */

/* -------------------------------  ETH_AHB_STATUS  ------------------------------- */
#define ETH_AHB_STATUS_AHBMS_Pos              (0UL)                     /*!< ETH AHB_STATUS: AHBMS (Bit 0)                               */
#define ETH_AHB_STATUS_AHBMS_Msk              (0x1UL)                   /*!< ETH AHB_STATUS: AHBMS (Bitfield-Mask: 0x01)                 */

/* --------------------  ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR  -------------------- */
#define ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_Pos (0UL)      /*!< ETH CURRENT_HOST_TRANSMIT_DESCRIPTOR: CURTDESAPTR (Bit 0)   */
#define ETH_CURRENT_HOST_TRANSMIT_DESCRIPTOR_CURTDESAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_TRANSMIT_DESCRIPTOR: CURTDESAPTR (Bitfield-Mask: 0xffffffff) */

/* ---------------------  ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR  -------------------- */
#define ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_Pos (0UL)       /*!< ETH CURRENT_HOST_RECEIVE_DESCRIPTOR: CURRDESAPTR (Bit 0)    */
#define ETH_CURRENT_HOST_RECEIVE_DESCRIPTOR_CURRDESAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_RECEIVE_DESCRIPTOR: CURRDESAPTR (Bitfield-Mask: 0xffffffff) */

/* ------------------  ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS  ------------------ */
#define ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_Pos (0UL)  /*!< ETH CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS: CURTBUFAPTR (Bit 0) */
#define ETH_CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS_CURTBUFAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_TRANSMIT_BUFFER_ADDRESS: CURTBUFAPTR (Bitfield-Mask: 0xffffffff) */

/* -------------------  ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS  ------------------ */
#define ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_Pos (0UL)   /*!< ETH CURRENT_HOST_RECEIVE_BUFFER_ADDRESS: CURRBUFAPTR (Bit 0) */
#define ETH_CURRENT_HOST_RECEIVE_BUFFER_ADDRESS_CURRBUFAPTR_Msk (0xffffffffUL) /*!< ETH CURRENT_HOST_RECEIVE_BUFFER_ADDRESS: CURRBUFAPTR (Bitfield-Mask: 0xffffffff) */

/* -------------------------------  ETH_HW_FEATURE  ------------------------------- */
#define ETH_HW_FEATURE_MIISEL_Pos             (0UL)                     /*!< ETH HW_FEATURE: MIISEL (Bit 0)                              */
#define ETH_HW_FEATURE_MIISEL_Msk             (0x1UL)                   /*!< ETH HW_FEATURE: MIISEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_GMIISEL_Pos            (1UL)                     /*!< ETH HW_FEATURE: GMIISEL (Bit 1)                             */
#define ETH_HW_FEATURE_GMIISEL_Msk            (0x2UL)                   /*!< ETH HW_FEATURE: GMIISEL (Bitfield-Mask: 0x01)               */
#define ETH_HW_FEATURE_HDSEL_Pos              (2UL)                     /*!< ETH HW_FEATURE: HDSEL (Bit 2)                               */
#define ETH_HW_FEATURE_HDSEL_Msk              (0x4UL)                   /*!< ETH HW_FEATURE: HDSEL (Bitfield-Mask: 0x01)                 */
#define ETH_HW_FEATURE_EXTHASHEN_Pos          (3UL)                     /*!< ETH HW_FEATURE: EXTHASHEN (Bit 3)                           */
#define ETH_HW_FEATURE_EXTHASHEN_Msk          (0x8UL)                   /*!< ETH HW_FEATURE: EXTHASHEN (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_HASHSEL_Pos            (4UL)                     /*!< ETH HW_FEATURE: HASHSEL (Bit 4)                             */
#define ETH_HW_FEATURE_HASHSEL_Msk            (0x10UL)                  /*!< ETH HW_FEATURE: HASHSEL (Bitfield-Mask: 0x01)               */
#define ETH_HW_FEATURE_ADDMACADRSEL_Pos       (5UL)                     /*!< ETH HW_FEATURE: ADDMACADRSEL (Bit 5)                        */
#define ETH_HW_FEATURE_ADDMACADRSEL_Msk       (0x20UL)                  /*!< ETH HW_FEATURE: ADDMACADRSEL (Bitfield-Mask: 0x01)          */
#define ETH_HW_FEATURE_PCSSEL_Pos             (6UL)                     /*!< ETH HW_FEATURE: PCSSEL (Bit 6)                              */
#define ETH_HW_FEATURE_PCSSEL_Msk             (0x40UL)                  /*!< ETH HW_FEATURE: PCSSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_L3L4FLTREN_Pos         (7UL)                     /*!< ETH HW_FEATURE: L3L4FLTREN (Bit 7)                          */
#define ETH_HW_FEATURE_L3L4FLTREN_Msk         (0x80UL)                  /*!< ETH HW_FEATURE: L3L4FLTREN (Bitfield-Mask: 0x01)            */
#define ETH_HW_FEATURE_SMASEL_Pos             (8UL)                     /*!< ETH HW_FEATURE: SMASEL (Bit 8)                              */
#define ETH_HW_FEATURE_SMASEL_Msk             (0x100UL)                 /*!< ETH HW_FEATURE: SMASEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_RWKSEL_Pos             (9UL)                     /*!< ETH HW_FEATURE: RWKSEL (Bit 9)                              */
#define ETH_HW_FEATURE_RWKSEL_Msk             (0x200UL)                 /*!< ETH HW_FEATURE: RWKSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_MGKSEL_Pos             (10UL)                    /*!< ETH HW_FEATURE: MGKSEL (Bit 10)                             */
#define ETH_HW_FEATURE_MGKSEL_Msk             (0x400UL)                 /*!< ETH HW_FEATURE: MGKSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_MMCSEL_Pos             (11UL)                    /*!< ETH HW_FEATURE: MMCSEL (Bit 11)                             */
#define ETH_HW_FEATURE_MMCSEL_Msk             (0x800UL)                 /*!< ETH HW_FEATURE: MMCSEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_TSVER1SEL_Pos          (12UL)                    /*!< ETH HW_FEATURE: TSVER1SEL (Bit 12)                          */
#define ETH_HW_FEATURE_TSVER1SEL_Msk          (0x1000UL)                /*!< ETH HW_FEATURE: TSVER1SEL (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_TSVER2SEL_Pos          (13UL)                    /*!< ETH HW_FEATURE: TSVER2SEL (Bit 13)                          */
#define ETH_HW_FEATURE_TSVER2SEL_Msk          (0x2000UL)                /*!< ETH HW_FEATURE: TSVER2SEL (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_EEESEL_Pos             (14UL)                    /*!< ETH HW_FEATURE: EEESEL (Bit 14)                             */
#define ETH_HW_FEATURE_EEESEL_Msk             (0x4000UL)                /*!< ETH HW_FEATURE: EEESEL (Bitfield-Mask: 0x01)                */
#define ETH_HW_FEATURE_AVSEL_Pos              (15UL)                    /*!< ETH HW_FEATURE: AVSEL (Bit 15)                              */
#define ETH_HW_FEATURE_AVSEL_Msk              (0x8000UL)                /*!< ETH HW_FEATURE: AVSEL (Bitfield-Mask: 0x01)                 */
#define ETH_HW_FEATURE_TXCOESEL_Pos           (16UL)                    /*!< ETH HW_FEATURE: TXCOESEL (Bit 16)                           */
#define ETH_HW_FEATURE_TXCOESEL_Msk           (0x10000UL)               /*!< ETH HW_FEATURE: TXCOESEL (Bitfield-Mask: 0x01)              */
#define ETH_HW_FEATURE_RXTYP1COE_Pos          (17UL)                    /*!< ETH HW_FEATURE: RXTYP1COE (Bit 17)                          */
#define ETH_HW_FEATURE_RXTYP1COE_Msk          (0x20000UL)               /*!< ETH HW_FEATURE: RXTYP1COE (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_RXTYP2COE_Pos          (18UL)                    /*!< ETH HW_FEATURE: RXTYP2COE (Bit 18)                          */
#define ETH_HW_FEATURE_RXTYP2COE_Msk          (0x40000UL)               /*!< ETH HW_FEATURE: RXTYP2COE (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_RXFIFOSIZE_Pos         (19UL)                    /*!< ETH HW_FEATURE: RXFIFOSIZE (Bit 19)                         */
#define ETH_HW_FEATURE_RXFIFOSIZE_Msk         (0x80000UL)               /*!< ETH HW_FEATURE: RXFIFOSIZE (Bitfield-Mask: 0x01)            */
#define ETH_HW_FEATURE_RXCHCNT_Pos            (20UL)                    /*!< ETH HW_FEATURE: RXCHCNT (Bit 20)                            */
#define ETH_HW_FEATURE_RXCHCNT_Msk            (0x300000UL)              /*!< ETH HW_FEATURE: RXCHCNT (Bitfield-Mask: 0x03)               */
#define ETH_HW_FEATURE_TXCHCNT_Pos            (22UL)                    /*!< ETH HW_FEATURE: TXCHCNT (Bit 22)                            */
#define ETH_HW_FEATURE_TXCHCNT_Msk            (0xc00000UL)              /*!< ETH HW_FEATURE: TXCHCNT (Bitfield-Mask: 0x03)               */
#define ETH_HW_FEATURE_ENHDESSEL_Pos          (24UL)                    /*!< ETH HW_FEATURE: ENHDESSEL (Bit 24)                          */
#define ETH_HW_FEATURE_ENHDESSEL_Msk          (0x1000000UL)             /*!< ETH HW_FEATURE: ENHDESSEL (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_INTTSEN_Pos            (25UL)                    /*!< ETH HW_FEATURE: INTTSEN (Bit 25)                            */
#define ETH_HW_FEATURE_INTTSEN_Msk            (0x2000000UL)             /*!< ETH HW_FEATURE: INTTSEN (Bitfield-Mask: 0x01)               */
#define ETH_HW_FEATURE_FLEXIPPSEN_Pos         (26UL)                    /*!< ETH HW_FEATURE: FLEXIPPSEN (Bit 26)                         */
#define ETH_HW_FEATURE_FLEXIPPSEN_Msk         (0x4000000UL)             /*!< ETH HW_FEATURE: FLEXIPPSEN (Bitfield-Mask: 0x01)            */
#define ETH_HW_FEATURE_SAVLANINS_Pos          (27UL)                    /*!< ETH HW_FEATURE: SAVLANINS (Bit 27)                          */
#define ETH_HW_FEATURE_SAVLANINS_Msk          (0x8000000UL)             /*!< ETH HW_FEATURE: SAVLANINS (Bitfield-Mask: 0x01)             */
#define ETH_HW_FEATURE_ACTPHYIF_Pos           (28UL)                    /*!< ETH HW_FEATURE: ACTPHYIF (Bit 28)                           */
#define ETH_HW_FEATURE_ACTPHYIF_Msk           (0x70000000UL)            /*!< ETH HW_FEATURE: ACTPHYIF (Bitfield-Mask: 0x07)              */


/* ================================================================================ */
/* ================       struct 'ECAT0_CON' Position & Mask       ================ */
/* ================================================================================ */


/* --------------------------------  ECAT0_CON_CON  ------------------------------- */
#define ECAT0_CON_CON_ECATRSTEN_Pos           (0UL)                     /*!< ECAT0_CON CON: ECATRSTEN (Bit 0)                            */
#define ECAT0_CON_CON_ECATRSTEN_Msk           (0x1UL)                   /*!< ECAT0_CON CON: ECATRSTEN (Bitfield-Mask: 0x01)              */
#define ECAT0_CON_CON_LATCHIN0SEL_Pos         (8UL)                     /*!< ECAT0_CON CON: LATCHIN0SEL (Bit 8)                          */
#define ECAT0_CON_CON_LATCHIN0SEL_Msk         (0x300UL)                 /*!< ECAT0_CON CON: LATCHIN0SEL (Bitfield-Mask: 0x03)            */
#define ECAT0_CON_CON_LATCHIN0_Pos            (11UL)                    /*!< ECAT0_CON CON: LATCHIN0 (Bit 11)                            */
#define ECAT0_CON_CON_LATCHIN0_Msk            (0x800UL)                 /*!< ECAT0_CON CON: LATCHIN0 (Bitfield-Mask: 0x01)               */
#define ECAT0_CON_CON_LATCHIN1SEL_Pos         (12UL)                    /*!< ECAT0_CON CON: LATCHIN1SEL (Bit 12)                         */
#define ECAT0_CON_CON_LATCHIN1SEL_Msk         (0x3000UL)                /*!< ECAT0_CON CON: LATCHIN1SEL (Bitfield-Mask: 0x03)            */
#define ECAT0_CON_CON_LATCHIN1_Pos            (15UL)                    /*!< ECAT0_CON CON: LATCHIN1 (Bit 15)                            */
#define ECAT0_CON_CON_LATCHIN1_Msk            (0x8000UL)                /*!< ECAT0_CON CON: LATCHIN1 (Bitfield-Mask: 0x01)               */
#define ECAT0_CON_CON_PHYOFFSET_Pos           (16UL)                    /*!< ECAT0_CON CON: PHYOFFSET (Bit 16)                           */
#define ECAT0_CON_CON_PHYOFFSET_Msk           (0x1f0000UL)              /*!< ECAT0_CON CON: PHYOFFSET (Bitfield-Mask: 0x1f)              */
#define ECAT0_CON_CON_MDIO_Pos                (22UL)                    /*!< ECAT0_CON CON: MDIO (Bit 22)                                */
#define ECAT0_CON_CON_MDIO_Msk                (0xc00000UL)              /*!< ECAT0_CON CON: MDIO (Bitfield-Mask: 0x03)                   */

/* -------------------------------  ECAT0_CON_CONP0  ------------------------------ */
#define ECAT0_CON_CONP0_RXD0_Pos              (0UL)                     /*!< ECAT0_CON CONP0: RXD0 (Bit 0)                               */
#define ECAT0_CON_CONP0_RXD0_Msk              (0x3UL)                   /*!< ECAT0_CON CONP0: RXD0 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP0_RXD1_Pos              (2UL)                     /*!< ECAT0_CON CONP0: RXD1 (Bit 2)                               */
#define ECAT0_CON_CONP0_RXD1_Msk              (0xcUL)                   /*!< ECAT0_CON CONP0: RXD1 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP0_RXD2_Pos              (4UL)                     /*!< ECAT0_CON CONP0: RXD2 (Bit 4)                               */
#define ECAT0_CON_CONP0_RXD2_Msk              (0x30UL)                  /*!< ECAT0_CON CONP0: RXD2 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP0_RXD3_Pos              (6UL)                     /*!< ECAT0_CON CONP0: RXD3 (Bit 6)                               */
#define ECAT0_CON_CONP0_RXD3_Msk              (0xc0UL)                  /*!< ECAT0_CON CONP0: RXD3 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP0_RX_ERR_Pos            (8UL)                     /*!< ECAT0_CON CONP0: RX_ERR (Bit 8)                             */
#define ECAT0_CON_CONP0_RX_ERR_Msk            (0x300UL)                 /*!< ECAT0_CON CONP0: RX_ERR (Bitfield-Mask: 0x03)               */
#define ECAT0_CON_CONP0_RX_DV_Pos             (10UL)                    /*!< ECAT0_CON CONP0: RX_DV (Bit 10)                             */
#define ECAT0_CON_CONP0_RX_DV_Msk             (0xc00UL)                 /*!< ECAT0_CON CONP0: RX_DV (Bitfield-Mask: 0x03)                */
#define ECAT0_CON_CONP0_RX_CLK_Pos            (12UL)                    /*!< ECAT0_CON CONP0: RX_CLK (Bit 12)                            */
#define ECAT0_CON_CONP0_RX_CLK_Msk            (0x3000UL)                /*!< ECAT0_CON CONP0: RX_CLK (Bitfield-Mask: 0x03)               */
#define ECAT0_CON_CONP0_LINK_Pos              (16UL)                    /*!< ECAT0_CON CONP0: LINK (Bit 16)                              */
#define ECAT0_CON_CONP0_LINK_Msk              (0x30000UL)               /*!< ECAT0_CON CONP0: LINK (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP0_TX_CLK_Pos            (28UL)                    /*!< ECAT0_CON CONP0: TX_CLK (Bit 28)                            */
#define ECAT0_CON_CONP0_TX_CLK_Msk            (0x30000000UL)            /*!< ECAT0_CON CONP0: TX_CLK (Bitfield-Mask: 0x03)               */
#define ECAT0_CON_CONP0_TX_SHIFT_Pos          (30UL)                    /*!< ECAT0_CON CONP0: TX_SHIFT (Bit 30)                          */
#define ECAT0_CON_CONP0_TX_SHIFT_Msk          (0xc0000000UL)            /*!< ECAT0_CON CONP0: TX_SHIFT (Bitfield-Mask: 0x03)             */

