alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* -------------------------------  ECAT0_CON_CONP1  ------------------------------ */
#define ECAT0_CON_CONP1_RXD0_Pos              (0UL)                     /*!< ECAT0_CON CONP1: RXD0 (Bit 0)                               */
#define ECAT0_CON_CONP1_RXD0_Msk              (0x3UL)                   /*!< ECAT0_CON CONP1: RXD0 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP1_RXD1_Pos              (2UL)                     /*!< ECAT0_CON CONP1: RXD1 (Bit 2)                               */
#define ECAT0_CON_CONP1_RXD1_Msk              (0xcUL)                   /*!< ECAT0_CON CONP1: RXD1 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP1_RXD2_Pos              (4UL)                     /*!< ECAT0_CON CONP1: RXD2 (Bit 4)                               */
#define ECAT0_CON_CONP1_RXD2_Msk              (0x30UL)                  /*!< ECAT0_CON CONP1: RXD2 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP1_RXD3_Pos              (6UL)                     /*!< ECAT0_CON CONP1: RXD3 (Bit 6)                               */
#define ECAT0_CON_CONP1_RXD3_Msk              (0xc0UL)                  /*!< ECAT0_CON CONP1: RXD3 (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP1_RX_ERR_Pos            (8UL)                     /*!< ECAT0_CON CONP1: RX_ERR (Bit 8)                             */
#define ECAT0_CON_CONP1_RX_ERR_Msk            (0x300UL)                 /*!< ECAT0_CON CONP1: RX_ERR (Bitfield-Mask: 0x03)               */
#define ECAT0_CON_CONP1_RX_DV_Pos             (10UL)                    /*!< ECAT0_CON CONP1: RX_DV (Bit 10)                             */
#define ECAT0_CON_CONP1_RX_DV_Msk             (0xc00UL)                 /*!< ECAT0_CON CONP1: RX_DV (Bitfield-Mask: 0x03)                */
#define ECAT0_CON_CONP1_RX_CLK_Pos            (12UL)                    /*!< ECAT0_CON CONP1: RX_CLK (Bit 12)                            */
#define ECAT0_CON_CONP1_RX_CLK_Msk            (0x3000UL)                /*!< ECAT0_CON CONP1: RX_CLK (Bitfield-Mask: 0x03)               */
#define ECAT0_CON_CONP1_LINK_Pos              (16UL)                    /*!< ECAT0_CON CONP1: LINK (Bit 16)                              */
#define ECAT0_CON_CONP1_LINK_Msk              (0x30000UL)               /*!< ECAT0_CON CONP1: LINK (Bitfield-Mask: 0x03)                 */
#define ECAT0_CON_CONP1_TX_CLK_Pos            (28UL)                    /*!< ECAT0_CON CONP1: TX_CLK (Bit 28)                            */
#define ECAT0_CON_CONP1_TX_CLK_Msk            (0x30000000UL)            /*!< ECAT0_CON CONP1: TX_CLK (Bitfield-Mask: 0x03)               */
#define ECAT0_CON_CONP1_TX_SHIFT_Pos          (30UL)                    /*!< ECAT0_CON CONP1: TX_SHIFT (Bit 30)                          */
#define ECAT0_CON_CONP1_TX_SHIFT_Msk          (0xc0000000UL)            /*!< ECAT0_CON CONP1: TX_SHIFT (Bitfield-Mask: 0x03)             */


/* ================================================================================ */
/* ================          Group 'ECAT' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------------  ECAT_TYPE  --------------------------------- */
#define ECAT_TYPE_Type_Pos                    (0UL)                     /*!< ECAT TYPE: Type (Bit 0)                                     */
#define ECAT_TYPE_Type_Msk                    (0xffUL)                  /*!< ECAT TYPE: Type (Bitfield-Mask: 0xff)                       */

/* --------------------------------  ECAT_REVISION  ------------------------------- */
#define ECAT_REVISION_Revision_Pos            (0UL)                     /*!< ECAT REVISION: Revision (Bit 0)                             */
#define ECAT_REVISION_Revision_Msk            (0xffUL)                  /*!< ECAT REVISION: Revision (Bitfield-Mask: 0xff)               */

/* ---------------------------------  ECAT_BUILD  --------------------------------- */
#define ECAT_BUILD_BUILD_Pos                  (0UL)                     /*!< ECAT BUILD: BUILD (Bit 0)                                   */
#define ECAT_BUILD_BUILD_Msk                  (0xffffUL)                /*!< ECAT BUILD: BUILD (Bitfield-Mask: 0xffff)                   */

/* --------------------------------  ECAT_FMMU_NUM  ------------------------------- */
#define ECAT_FMMU_NUM_NUM_FMMU_Pos            (0UL)                     /*!< ECAT FMMU_NUM: NUM_FMMU (Bit 0)                             */
#define ECAT_FMMU_NUM_NUM_FMMU_Msk            (0xffUL)                  /*!< ECAT FMMU_NUM: NUM_FMMU (Bitfield-Mask: 0xff)               */

/* ------------------------------  ECAT_SYNC_MANAGER  ----------------------------- */
#define ECAT_SYNC_MANAGER_NUM_SM_Pos          (0UL)                     /*!< ECAT SYNC_MANAGER: NUM_SM (Bit 0)                           */
#define ECAT_SYNC_MANAGER_NUM_SM_Msk          (0xffUL)                  /*!< ECAT SYNC_MANAGER: NUM_SM (Bitfield-Mask: 0xff)             */

/* --------------------------------  ECAT_RAM_SIZE  ------------------------------- */
#define ECAT_RAM_SIZE_RAM_Size_Pos            (0UL)                     /*!< ECAT RAM_SIZE: RAM_Size (Bit 0)                             */
#define ECAT_RAM_SIZE_RAM_Size_Msk            (0xffUL)                  /*!< ECAT RAM_SIZE: RAM_Size (Bitfield-Mask: 0xff)               */

/* -------------------------------  ECAT_PORT_DESC  ------------------------------- */
#define ECAT_PORT_DESC_Port0_Pos              (0UL)                     /*!< ECAT PORT_DESC: Port0 (Bit 0)                               */
#define ECAT_PORT_DESC_Port0_Msk              (0x3UL)                   /*!< ECAT PORT_DESC: Port0 (Bitfield-Mask: 0x03)                 */
#define ECAT_PORT_DESC_Port1_Pos              (2UL)                     /*!< ECAT PORT_DESC: Port1 (Bit 2)                               */
#define ECAT_PORT_DESC_Port1_Msk              (0xcUL)                   /*!< ECAT PORT_DESC: Port1 (Bitfield-Mask: 0x03)                 */
#define ECAT_PORT_DESC_Port2_Pos              (4UL)                     /*!< ECAT PORT_DESC: Port2 (Bit 4)                               */
#define ECAT_PORT_DESC_Port2_Msk              (0x30UL)                  /*!< ECAT PORT_DESC: Port2 (Bitfield-Mask: 0x03)                 */
#define ECAT_PORT_DESC_Port3_Pos              (6UL)                     /*!< ECAT PORT_DESC: Port3 (Bit 6)                               */
#define ECAT_PORT_DESC_Port3_Msk              (0xc0UL)                  /*!< ECAT PORT_DESC: Port3 (Bitfield-Mask: 0x03)                 */

/* --------------------------------  ECAT_FEATURE  -------------------------------- */
#define ECAT_FEATURE_FMMU_Pos                 (0UL)                     /*!< ECAT FEATURE: FMMU (Bit 0)                                  */
#define ECAT_FEATURE_FMMU_Msk                 (0x1UL)                   /*!< ECAT FEATURE: FMMU (Bitfield-Mask: 0x01)                    */
#define ECAT_FEATURE_CLKS_Pos                 (2UL)                     /*!< ECAT FEATURE: CLKS (Bit 2)                                  */
#define ECAT_FEATURE_CLKS_Msk                 (0x4UL)                   /*!< ECAT FEATURE: CLKS (Bitfield-Mask: 0x01)                    */
#define ECAT_FEATURE_CLKS_W_Pos               (3UL)                     /*!< ECAT FEATURE: CLKS_W (Bit 3)                                */
#define ECAT_FEATURE_CLKS_W_Msk               (0x8UL)                   /*!< ECAT FEATURE: CLKS_W (Bitfield-Mask: 0x01)                  */
#define ECAT_FEATURE_LJ_EBUS_Pos              (4UL)                     /*!< ECAT FEATURE: LJ_EBUS (Bit 4)                               */
#define ECAT_FEATURE_LJ_EBUS_Msk              (0x10UL)                  /*!< ECAT FEATURE: LJ_EBUS (Bitfield-Mask: 0x01)                 */
#define ECAT_FEATURE_ELD_EBUS_Pos             (5UL)                     /*!< ECAT FEATURE: ELD_EBUS (Bit 5)                              */
#define ECAT_FEATURE_ELD_EBUS_Msk             (0x20UL)                  /*!< ECAT FEATURE: ELD_EBUS (Bitfield-Mask: 0x01)                */
#define ECAT_FEATURE_ELD_MII_Pos              (6UL)                     /*!< ECAT FEATURE: ELD_MII (Bit 6)                               */
#define ECAT_FEATURE_ELD_MII_Msk              (0x40UL)                  /*!< ECAT FEATURE: ELD_MII (Bitfield-Mask: 0x01)                 */
#define ECAT_FEATURE_SH_FCSE_Pos              (7UL)                     /*!< ECAT FEATURE: SH_FCSE (Bit 7)                               */
#define ECAT_FEATURE_SH_FCSE_Msk              (0x80UL)                  /*!< ECAT FEATURE: SH_FCSE (Bitfield-Mask: 0x01)                 */
#define ECAT_FEATURE_EDC_SYNCA_Pos            (8UL)                     /*!< ECAT FEATURE: EDC_SYNCA (Bit 8)                             */
#define ECAT_FEATURE_EDC_SYNCA_Msk            (0x100UL)                 /*!< ECAT FEATURE: EDC_SYNCA (Bitfield-Mask: 0x01)               */
#define ECAT_FEATURE_LRW_CS_Pos               (9UL)                     /*!< ECAT FEATURE: LRW_CS (Bit 9)                                */
#define ECAT_FEATURE_LRW_CS_Msk               (0x200UL)                 /*!< ECAT FEATURE: LRW_CS (Bitfield-Mask: 0x01)                  */
#define ECAT_FEATURE_RW_CS_Pos                (10UL)                    /*!< ECAT FEATURE: RW_CS (Bit 10)                                */
#define ECAT_FEATURE_RW_CS_Msk                (0x400UL)                 /*!< ECAT FEATURE: RW_CS (Bitfield-Mask: 0x01)                   */
#define ECAT_FEATURE_FX_CONF_Pos              (11UL)                    /*!< ECAT FEATURE: FX_CONF (Bit 11)                              */
#define ECAT_FEATURE_FX_CONF_Msk              (0x800UL)                 /*!< ECAT FEATURE: FX_CONF (Bitfield-Mask: 0x01)                 */

