alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* ---------------------------  ECAT_PHYSICAL_RW_OFFSET  -------------------------- */
#define ECAT_PHYSICAL_RW_OFFSET_OFFSET_Pos    (0UL)                     /*!< ECAT PHYSICAL_RW_OFFSET: OFFSET (Bit 0)                     */
#define ECAT_PHYSICAL_RW_OFFSET_OFFSET_Msk    (0xffffUL)                /*!< ECAT PHYSICAL_RW_OFFSET: OFFSET (Bitfield-Mask: 0xffff)     */

/* -----------------------------  ECAT_ESC_DL_STATUS  ----------------------------- */
#define ECAT_ESC_DL_STATUS_PDI_EEPROM_Pos     (0UL)                     /*!< ECAT ESC_DL_STATUS: PDI_EEPROM (Bit 0)                      */
#define ECAT_ESC_DL_STATUS_PDI_EEPROM_Msk     (0x1UL)                   /*!< ECAT ESC_DL_STATUS: PDI_EEPROM (Bitfield-Mask: 0x01)        */
#define ECAT_ESC_DL_STATUS_PDI_WDT_S_Pos      (1UL)                     /*!< ECAT ESC_DL_STATUS: PDI_WDT_S (Bit 1)                       */
#define ECAT_ESC_DL_STATUS_PDI_WDT_S_Msk      (0x2UL)                   /*!< ECAT ESC_DL_STATUS: PDI_WDT_S (Bitfield-Mask: 0x01)         */
#define ECAT_ESC_DL_STATUS_ELD_Pos            (2UL)                     /*!< ECAT ESC_DL_STATUS: ELD (Bit 2)                             */
#define ECAT_ESC_DL_STATUS_ELD_Msk            (0x4UL)                   /*!< ECAT ESC_DL_STATUS: ELD (Bitfield-Mask: 0x01)               */
#define ECAT_ESC_DL_STATUS_LINK_P0_Pos        (4UL)                     /*!< ECAT ESC_DL_STATUS: LINK_P0 (Bit 4)                         */
#define ECAT_ESC_DL_STATUS_LINK_P0_Msk        (0x10UL)                  /*!< ECAT ESC_DL_STATUS: LINK_P0 (Bitfield-Mask: 0x01)           */
#define ECAT_ESC_DL_STATUS_LINK_P1_Pos        (5UL)                     /*!< ECAT ESC_DL_STATUS: LINK_P1 (Bit 5)                         */
#define ECAT_ESC_DL_STATUS_LINK_P1_Msk        (0x20UL)                  /*!< ECAT ESC_DL_STATUS: LINK_P1 (Bitfield-Mask: 0x01)           */
#define ECAT_ESC_DL_STATUS_LINK_P2_Pos        (6UL)                     /*!< ECAT ESC_DL_STATUS: LINK_P2 (Bit 6)                         */
#define ECAT_ESC_DL_STATUS_LINK_P2_Msk        (0x40UL)                  /*!< ECAT ESC_DL_STATUS: LINK_P2 (Bitfield-Mask: 0x01)           */
#define ECAT_ESC_DL_STATUS_LINK_P3_Pos        (7UL)                     /*!< ECAT ESC_DL_STATUS: LINK_P3 (Bit 7)                         */
#define ECAT_ESC_DL_STATUS_LINK_P3_Msk        (0x80UL)                  /*!< ECAT ESC_DL_STATUS: LINK_P3 (Bitfield-Mask: 0x01)           */
#define ECAT_ESC_DL_STATUS_LP0_Pos            (8UL)                     /*!< ECAT ESC_DL_STATUS: LP0 (Bit 8)                             */
#define ECAT_ESC_DL_STATUS_LP0_Msk            (0x100UL)                 /*!< ECAT ESC_DL_STATUS: LP0 (Bitfield-Mask: 0x01)               */
#define ECAT_ESC_DL_STATUS_COM_P0_Pos         (9UL)                     /*!< ECAT ESC_DL_STATUS: COM_P0 (Bit 9)                          */
#define ECAT_ESC_DL_STATUS_COM_P0_Msk         (0x200UL)                 /*!< ECAT ESC_DL_STATUS: COM_P0 (Bitfield-Mask: 0x01)            */
#define ECAT_ESC_DL_STATUS_LP1_Pos            (10UL)                    /*!< ECAT ESC_DL_STATUS: LP1 (Bit 10)                            */
#define ECAT_ESC_DL_STATUS_LP1_Msk            (0x400UL)                 /*!< ECAT ESC_DL_STATUS: LP1 (Bitfield-Mask: 0x01)               */
#define ECAT_ESC_DL_STATUS_COM_P1_Pos         (11UL)                    /*!< ECAT ESC_DL_STATUS: COM_P1 (Bit 11)                         */
#define ECAT_ESC_DL_STATUS_COM_P1_Msk         (0x800UL)                 /*!< ECAT ESC_DL_STATUS: COM_P1 (Bitfield-Mask: 0x01)            */
#define ECAT_ESC_DL_STATUS_LP2_Pos            (12UL)                    /*!< ECAT ESC_DL_STATUS: LP2 (Bit 12)                            */
#define ECAT_ESC_DL_STATUS_LP2_Msk            (0x1000UL)                /*!< ECAT ESC_DL_STATUS: LP2 (Bitfield-Mask: 0x01)               */
#define ECAT_ESC_DL_STATUS_COM_P2_Pos         (13UL)                    /*!< ECAT ESC_DL_STATUS: COM_P2 (Bit 13)                         */
#define ECAT_ESC_DL_STATUS_COM_P2_Msk         (0x2000UL)                /*!< ECAT ESC_DL_STATUS: COM_P2 (Bitfield-Mask: 0x01)            */
#define ECAT_ESC_DL_STATUS_LP3_Pos            (14UL)                    /*!< ECAT ESC_DL_STATUS: LP3 (Bit 14)                            */
#define ECAT_ESC_DL_STATUS_LP3_Msk            (0x4000UL)                /*!< ECAT ESC_DL_STATUS: LP3 (Bitfield-Mask: 0x01)               */
#define ECAT_ESC_DL_STATUS_COM_P3_Pos         (15UL)                    /*!< ECAT ESC_DL_STATUS: COM_P3 (Bit 15)                         */
#define ECAT_ESC_DL_STATUS_COM_P3_Msk         (0x8000UL)                /*!< ECAT ESC_DL_STATUS: COM_P3 (Bitfield-Mask: 0x01)            */

/* -------------------------------  ECAT_AL_CONTROL  ------------------------------ */
#define ECAT_AL_CONTROL_IST_Pos               (0UL)                     /*!< ECAT AL_CONTROL: IST (Bit 0)                                */
#define ECAT_AL_CONTROL_IST_Msk               (0xfUL)                   /*!< ECAT AL_CONTROL: IST (Bitfield-Mask: 0x0f)                  */
#define ECAT_AL_CONTROL_EIA_Pos               (4UL)                     /*!< ECAT AL_CONTROL: EIA (Bit 4)                                */
#define ECAT_AL_CONTROL_EIA_Msk               (0x10UL)                  /*!< ECAT AL_CONTROL: EIA (Bitfield-Mask: 0x01)                  */
#define ECAT_AL_CONTROL_DID_Pos               (5UL)                     /*!< ECAT AL_CONTROL: DID (Bit 5)                                */
#define ECAT_AL_CONTROL_DID_Msk               (0x20UL)                  /*!< ECAT AL_CONTROL: DID (Bitfield-Mask: 0x01)                  */

/* -------------------------------  ECAT_AL_STATUS  ------------------------------- */
#define ECAT_AL_STATUS_STATE_Pos              (0UL)                     /*!< ECAT AL_STATUS: STATE (Bit 0)                               */
#define ECAT_AL_STATUS_STATE_Msk              (0xfUL)                   /*!< ECAT AL_STATUS: STATE (Bitfield-Mask: 0x0f)                 */
#define ECAT_AL_STATUS_ERRI_Pos               (4UL)                     /*!< ECAT AL_STATUS: ERRI (Bit 4)                                */
#define ECAT_AL_STATUS_ERRI_Msk               (0x10UL)                  /*!< ECAT AL_STATUS: ERRI (Bitfield-Mask: 0x01)                  */
#define ECAT_AL_STATUS_DID_Pos                (5UL)                     /*!< ECAT AL_STATUS: DID (Bit 5)                                 */
#define ECAT_AL_STATUS_DID_Msk                (0x20UL)                  /*!< ECAT AL_STATUS: DID (Bitfield-Mask: 0x01)                   */

/* -----------------------------  ECAT_AL_STATUS_CODE  ---------------------------- */
#define ECAT_AL_STATUS_CODE_AL_S_CODE_Pos     (0UL)                     /*!< ECAT AL_STATUS_CODE: AL_S_CODE (Bit 0)                      */
#define ECAT_AL_STATUS_CODE_AL_S_CODE_Msk     (0xffffUL)                /*!< ECAT AL_STATUS_CODE: AL_S_CODE (Bitfield-Mask: 0xffff)      */

/* --------------------------------  ECAT_RUN_LED  -------------------------------- */
#define ECAT_RUN_LED_LED_CODE_Pos             (0UL)                     /*!< ECAT RUN_LED: LED_CODE (Bit 0)                              */
#define ECAT_RUN_LED_LED_CODE_Msk             (0xfUL)                   /*!< ECAT RUN_LED: LED_CODE (Bitfield-Mask: 0x0f)                */
#define ECAT_RUN_LED_EN_OVERR_Pos             (4UL)                     /*!< ECAT RUN_LED: EN_OVERR (Bit 4)                              */
#define ECAT_RUN_LED_EN_OVERR_Msk             (0x10UL)                  /*!< ECAT RUN_LED: EN_OVERR (Bitfield-Mask: 0x01)                */

