alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* ------------------------------  ECAT_AL_EVENT_REQ  ----------------------------- */
#define ECAT_AL_EVENT_REQ_AL_CE_Pos           (0UL)                     /*!< ECAT AL_EVENT_REQ: AL_CE (Bit 0)                            */
#define ECAT_AL_EVENT_REQ_AL_CE_Msk           (0x1UL)                   /*!< ECAT AL_EVENT_REQ: AL_CE (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_DC_LE_Pos           (1UL)                     /*!< ECAT AL_EVENT_REQ: DC_LE (Bit 1)                            */
#define ECAT_AL_EVENT_REQ_DC_LE_Msk           (0x2UL)                   /*!< ECAT AL_EVENT_REQ: DC_LE (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_ST_S0_Pos           (2UL)                     /*!< ECAT AL_EVENT_REQ: ST_S0 (Bit 2)                            */
#define ECAT_AL_EVENT_REQ_ST_S0_Msk           (0x4UL)                   /*!< ECAT AL_EVENT_REQ: ST_S0 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_ST_S1_Pos           (3UL)                     /*!< ECAT AL_EVENT_REQ: ST_S1 (Bit 3)                            */
#define ECAT_AL_EVENT_REQ_ST_S1_Msk           (0x8UL)                   /*!< ECAT AL_EVENT_REQ: ST_S1 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SM_A_Pos            (4UL)                     /*!< ECAT AL_EVENT_REQ: SM_A (Bit 4)                             */
#define ECAT_AL_EVENT_REQ_SM_A_Msk            (0x10UL)                  /*!< ECAT AL_EVENT_REQ: SM_A (Bitfield-Mask: 0x01)               */
#define ECAT_AL_EVENT_REQ_EEP_E_Pos           (5UL)                     /*!< ECAT AL_EVENT_REQ: EEP_E (Bit 5)                            */
#define ECAT_AL_EVENT_REQ_EEP_E_Msk           (0x20UL)                  /*!< ECAT AL_EVENT_REQ: EEP_E (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_WP_D_Pos            (6UL)                     /*!< ECAT AL_EVENT_REQ: WP_D (Bit 6)                             */
#define ECAT_AL_EVENT_REQ_WP_D_Msk            (0x40UL)                  /*!< ECAT AL_EVENT_REQ: WP_D (Bitfield-Mask: 0x01)               */
#define ECAT_AL_EVENT_REQ_SMI_0_Pos           (8UL)                     /*!< ECAT AL_EVENT_REQ: SMI_0 (Bit 8)                            */
#define ECAT_AL_EVENT_REQ_SMI_0_Msk           (0x100UL)                 /*!< ECAT AL_EVENT_REQ: SMI_0 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_1_Pos           (9UL)                     /*!< ECAT AL_EVENT_REQ: SMI_1 (Bit 9)                            */
#define ECAT_AL_EVENT_REQ_SMI_1_Msk           (0x200UL)                 /*!< ECAT AL_EVENT_REQ: SMI_1 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_2_Pos           (10UL)                    /*!< ECAT AL_EVENT_REQ: SMI_2 (Bit 10)                           */
#define ECAT_AL_EVENT_REQ_SMI_2_Msk           (0x400UL)                 /*!< ECAT AL_EVENT_REQ: SMI_2 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_3_Pos           (11UL)                    /*!< ECAT AL_EVENT_REQ: SMI_3 (Bit 11)                           */
#define ECAT_AL_EVENT_REQ_SMI_3_Msk           (0x800UL)                 /*!< ECAT AL_EVENT_REQ: SMI_3 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_4_Pos           (12UL)                    /*!< ECAT AL_EVENT_REQ: SMI_4 (Bit 12)                           */
#define ECAT_AL_EVENT_REQ_SMI_4_Msk           (0x1000UL)                /*!< ECAT AL_EVENT_REQ: SMI_4 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_5_Pos           (13UL)                    /*!< ECAT AL_EVENT_REQ: SMI_5 (Bit 13)                           */
#define ECAT_AL_EVENT_REQ_SMI_5_Msk           (0x2000UL)                /*!< ECAT AL_EVENT_REQ: SMI_5 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_6_Pos           (14UL)                    /*!< ECAT AL_EVENT_REQ: SMI_6 (Bit 14)                           */
#define ECAT_AL_EVENT_REQ_SMI_6_Msk           (0x4000UL)                /*!< ECAT AL_EVENT_REQ: SMI_6 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_7_Pos           (15UL)                    /*!< ECAT AL_EVENT_REQ: SMI_7 (Bit 15)                           */
#define ECAT_AL_EVENT_REQ_SMI_7_Msk           (0x8000UL)                /*!< ECAT AL_EVENT_REQ: SMI_7 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_8_Pos           (16UL)                    /*!< ECAT AL_EVENT_REQ: SMI_8 (Bit 16)                           */
#define ECAT_AL_EVENT_REQ_SMI_8_Msk           (0x10000UL)               /*!< ECAT AL_EVENT_REQ: SMI_8 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_9_Pos           (17UL)                    /*!< ECAT AL_EVENT_REQ: SMI_9 (Bit 17)                           */
#define ECAT_AL_EVENT_REQ_SMI_9_Msk           (0x20000UL)               /*!< ECAT AL_EVENT_REQ: SMI_9 (Bitfield-Mask: 0x01)              */
#define ECAT_AL_EVENT_REQ_SMI_10_Pos          (18UL)                    /*!< ECAT AL_EVENT_REQ: SMI_10 (Bit 18)                          */
#define ECAT_AL_EVENT_REQ_SMI_10_Msk          (0x40000UL)               /*!< ECAT AL_EVENT_REQ: SMI_10 (Bitfield-Mask: 0x01)             */
#define ECAT_AL_EVENT_REQ_SMI_11_Pos          (19UL)                    /*!< ECAT AL_EVENT_REQ: SMI_11 (Bit 19)                          */
#define ECAT_AL_EVENT_REQ_SMI_11_Msk          (0x80000UL)               /*!< ECAT AL_EVENT_REQ: SMI_11 (Bitfield-Mask: 0x01)             */
#define ECAT_AL_EVENT_REQ_SMI_12_Pos          (20UL)                    /*!< ECAT AL_EVENT_REQ: SMI_12 (Bit 20)                          */
#define ECAT_AL_EVENT_REQ_SMI_12_Msk          (0x100000UL)              /*!< ECAT AL_EVENT_REQ: SMI_12 (Bitfield-Mask: 0x01)             */
#define ECAT_AL_EVENT_REQ_SMI_13_Pos          (21UL)                    /*!< ECAT AL_EVENT_REQ: SMI_13 (Bit 21)                          */
#define ECAT_AL_EVENT_REQ_SMI_13_Msk          (0x200000UL)              /*!< ECAT AL_EVENT_REQ: SMI_13 (Bitfield-Mask: 0x01)             */
#define ECAT_AL_EVENT_REQ_SMI_14_Pos          (22UL)                    /*!< ECAT AL_EVENT_REQ: SMI_14 (Bit 22)                          */
#define ECAT_AL_EVENT_REQ_SMI_14_Msk          (0x400000UL)              /*!< ECAT AL_EVENT_REQ: SMI_14 (Bitfield-Mask: 0x01)             */
#define ECAT_AL_EVENT_REQ_SMI_15_Pos          (23UL)                    /*!< ECAT AL_EVENT_REQ: SMI_15 (Bit 23)                          */
#define ECAT_AL_EVENT_REQ_SMI_15_Msk          (0x800000UL)              /*!< ECAT AL_EVENT_REQ: SMI_15 (Bitfield-Mask: 0x01)             */

/* -----------------------------  ECAT_RX_ERR_COUNT0  ----------------------------- */
#define ECAT_RX_ERR_COUNT0_INVALID_FRAME_Pos  (0UL)                     /*!< ECAT RX_ERR_COUNT0: INVALID_FRAME (Bit 0)                   */
#define ECAT_RX_ERR_COUNT0_INVALID_FRAME_Msk  (0xffUL)                  /*!< ECAT RX_ERR_COUNT0: INVALID_FRAME (Bitfield-Mask: 0xff)     */
#define ECAT_RX_ERR_COUNT0_RX_ERROR_Pos       (8UL)                     /*!< ECAT RX_ERR_COUNT0: RX_ERROR (Bit 8)                        */
#define ECAT_RX_ERR_COUNT0_RX_ERROR_Msk       (0xff00UL)                /*!< ECAT RX_ERR_COUNT0: RX_ERROR (Bitfield-Mask: 0xff)          */

/* -----------------------------  ECAT_RX_ERR_COUNT1  ----------------------------- */
#define ECAT_RX_ERR_COUNT1_INVALID_FRAME_Pos  (0UL)                     /*!< ECAT RX_ERR_COUNT1: INVALID_FRAME (Bit 0)                   */
#define ECAT_RX_ERR_COUNT1_INVALID_FRAME_Msk  (0xffUL)                  /*!< ECAT RX_ERR_COUNT1: INVALID_FRAME (Bitfield-Mask: 0xff)     */
#define ECAT_RX_ERR_COUNT1_RX_ERROR_Pos       (8UL)                     /*!< ECAT RX_ERR_COUNT1: RX_ERROR (Bit 8)                        */
#define ECAT_RX_ERR_COUNT1_RX_ERROR_Msk       (0xff00UL)                /*!< ECAT RX_ERR_COUNT1: RX_ERROR (Bitfield-Mask: 0xff)          */

/* ---------------------------  ECAT_FWD_RX_ERR_COUNT0  --------------------------- */
#define ECAT_FWD_RX_ERR_COUNT0_FORW_ERROR_Pos (0UL)                     /*!< ECAT FWD_RX_ERR_COUNT0: FORW_ERROR (Bit 0)                  */
#define ECAT_FWD_RX_ERR_COUNT0_FORW_ERROR_Msk (0xffUL)                  /*!< ECAT FWD_RX_ERR_COUNT0: FORW_ERROR (Bitfield-Mask: 0xff)    */

/* ---------------------------  ECAT_FWD_RX_ERR_COUNT1  --------------------------- */
#define ECAT_FWD_RX_ERR_COUNT1_FORW_ERROR_Pos (0UL)                     /*!< ECAT FWD_RX_ERR_COUNT1: FORW_ERROR (Bit 0)                  */
#define ECAT_FWD_RX_ERR_COUNT1_FORW_ERROR_Msk (0xffUL)                  /*!< ECAT FWD_RX_ERR_COUNT1: FORW_ERROR (Bitfield-Mask: 0xff)    */

/* -----------------------------  ECAT_PROC_ERR_COUNT  ---------------------------- */
#define ECAT_PROC_ERR_COUNT_UNIT_ERROR_Pos    (0UL)                     /*!< ECAT PROC_ERR_COUNT: UNIT_ERROR (Bit 0)                     */
#define ECAT_PROC_ERR_COUNT_UNIT_ERROR_Msk    (0xffUL)                  /*!< ECAT PROC_ERR_COUNT: UNIT_ERROR (Bitfield-Mask: 0xff)       */

