alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* ----------------------------  USB_GINTSTS_HOSTMODE  ---------------------------- */
#define USB_GINTSTS_HOSTMODE_CurMod_Pos       (0UL)                     /*!< USB GINTSTS_HOSTMODE: CurMod (Bit 0)                        */
#define USB_GINTSTS_HOSTMODE_CurMod_Msk       (0x1UL)                   /*!< USB GINTSTS_HOSTMODE: CurMod (Bitfield-Mask: 0x01)          */
#define USB_GINTSTS_HOSTMODE_ModeMis_Pos      (1UL)                     /*!< USB GINTSTS_HOSTMODE: ModeMis (Bit 1)                       */
#define USB_GINTSTS_HOSTMODE_ModeMis_Msk      (0x2UL)                   /*!< USB GINTSTS_HOSTMODE: ModeMis (Bitfield-Mask: 0x01)         */
#define USB_GINTSTS_HOSTMODE_OTGInt_Pos       (2UL)                     /*!< USB GINTSTS_HOSTMODE: OTGInt (Bit 2)                        */
#define USB_GINTSTS_HOSTMODE_OTGInt_Msk       (0x4UL)                   /*!< USB GINTSTS_HOSTMODE: OTGInt (Bitfield-Mask: 0x01)          */
#define USB_GINTSTS_HOSTMODE_Sof_Pos          (3UL)                     /*!< USB GINTSTS_HOSTMODE: Sof (Bit 3)                           */
#define USB_GINTSTS_HOSTMODE_Sof_Msk          (0x8UL)                   /*!< USB GINTSTS_HOSTMODE: Sof (Bitfield-Mask: 0x01)             */
#define USB_GINTSTS_HOSTMODE_RxFLvl_Pos       (4UL)                     /*!< USB GINTSTS_HOSTMODE: RxFLvl (Bit 4)                        */
#define USB_GINTSTS_HOSTMODE_RxFLvl_Msk       (0x10UL)                  /*!< USB GINTSTS_HOSTMODE: RxFLvl (Bitfield-Mask: 0x01)          */
#define USB_GINTSTS_HOSTMODE_incomplP_Pos     (21UL)                    /*!< USB GINTSTS_HOSTMODE: incomplP (Bit 21)                     */
#define USB_GINTSTS_HOSTMODE_incomplP_Msk     (0x200000UL)              /*!< USB GINTSTS_HOSTMODE: incomplP (Bitfield-Mask: 0x01)        */
#define USB_GINTSTS_HOSTMODE_PrtInt_Pos       (24UL)                    /*!< USB GINTSTS_HOSTMODE: PrtInt (Bit 24)                       */
#define USB_GINTSTS_HOSTMODE_PrtInt_Msk       (0x1000000UL)             /*!< USB GINTSTS_HOSTMODE: PrtInt (Bitfield-Mask: 0x01)          */
#define USB_GINTSTS_HOSTMODE_HChInt_Pos       (25UL)                    /*!< USB GINTSTS_HOSTMODE: HChInt (Bit 25)                       */
#define USB_GINTSTS_HOSTMODE_HChInt_Msk       (0x2000000UL)             /*!< USB GINTSTS_HOSTMODE: HChInt (Bitfield-Mask: 0x01)          */
#define USB_GINTSTS_HOSTMODE_PTxFEmp_Pos      (26UL)                    /*!< USB GINTSTS_HOSTMODE: PTxFEmp (Bit 26)                      */
#define USB_GINTSTS_HOSTMODE_PTxFEmp_Msk      (0x4000000UL)             /*!< USB GINTSTS_HOSTMODE: PTxFEmp (Bitfield-Mask: 0x01)         */
#define USB_GINTSTS_HOSTMODE_ConIDStsChng_Pos (28UL)                    /*!< USB GINTSTS_HOSTMODE: ConIDStsChng (Bit 28)                 */
#define USB_GINTSTS_HOSTMODE_ConIDStsChng_Msk (0x10000000UL)            /*!< USB GINTSTS_HOSTMODE: ConIDStsChng (Bitfield-Mask: 0x01)    */
#define USB_GINTSTS_HOSTMODE_DisconnInt_Pos   (29UL)                    /*!< USB GINTSTS_HOSTMODE: DisconnInt (Bit 29)                   */
#define USB_GINTSTS_HOSTMODE_DisconnInt_Msk   (0x20000000UL)            /*!< USB GINTSTS_HOSTMODE: DisconnInt (Bitfield-Mask: 0x01)      */
#define USB_GINTSTS_HOSTMODE_SessReqInt_Pos   (30UL)                    /*!< USB GINTSTS_HOSTMODE: SessReqInt (Bit 30)                   */
#define USB_GINTSTS_HOSTMODE_SessReqInt_Msk   (0x40000000UL)            /*!< USB GINTSTS_HOSTMODE: SessReqInt (Bitfield-Mask: 0x01)      */
#define USB_GINTSTS_HOSTMODE_WkUpInt_Pos      (31UL)                    /*!< USB GINTSTS_HOSTMODE: WkUpInt (Bit 31)                      */
#define USB_GINTSTS_HOSTMODE_WkUpInt_Msk      (0x80000000UL)            /*!< USB GINTSTS_HOSTMODE: WkUpInt (Bitfield-Mask: 0x01)         */

/* ---------------------------  USB_GINTSTS_DEVICEMODE  --------------------------- */
#define USB_GINTSTS_DEVICEMODE_CurMod_Pos     (0UL)                     /*!< USB GINTSTS_DEVICEMODE: CurMod (Bit 0)                      */
#define USB_GINTSTS_DEVICEMODE_CurMod_Msk     (0x1UL)                   /*!< USB GINTSTS_DEVICEMODE: CurMod (Bitfield-Mask: 0x01)        */
#define USB_GINTSTS_DEVICEMODE_ModeMis_Pos    (1UL)                     /*!< USB GINTSTS_DEVICEMODE: ModeMis (Bit 1)                     */
#define USB_GINTSTS_DEVICEMODE_ModeMis_Msk    (0x2UL)                   /*!< USB GINTSTS_DEVICEMODE: ModeMis (Bitfield-Mask: 0x01)       */
#define USB_GINTSTS_DEVICEMODE_OTGInt_Pos     (2UL)                     /*!< USB GINTSTS_DEVICEMODE: OTGInt (Bit 2)                      */
#define USB_GINTSTS_DEVICEMODE_OTGInt_Msk     (0x4UL)                   /*!< USB GINTSTS_DEVICEMODE: OTGInt (Bitfield-Mask: 0x01)        */
#define USB_GINTSTS_DEVICEMODE_Sof_Pos        (3UL)                     /*!< USB GINTSTS_DEVICEMODE: Sof (Bit 3)                         */
#define USB_GINTSTS_DEVICEMODE_Sof_Msk        (0x8UL)                   /*!< USB GINTSTS_DEVICEMODE: Sof (Bitfield-Mask: 0x01)           */
#define USB_GINTSTS_DEVICEMODE_RxFLvl_Pos     (4UL)                     /*!< USB GINTSTS_DEVICEMODE: RxFLvl (Bit 4)                      */
#define USB_GINTSTS_DEVICEMODE_RxFLvl_Msk     (0x10UL)                  /*!< USB GINTSTS_DEVICEMODE: RxFLvl (Bitfield-Mask: 0x01)        */
#define USB_GINTSTS_DEVICEMODE_GINNakEff_Pos  (6UL)                     /*!< USB GINTSTS_DEVICEMODE: GINNakEff (Bit 6)                   */
#define USB_GINTSTS_DEVICEMODE_GINNakEff_Msk  (0x40UL)                  /*!< USB GINTSTS_DEVICEMODE: GINNakEff (Bitfield-Mask: 0x01)     */
#define USB_GINTSTS_DEVICEMODE_GOUTNakEff_Pos (7UL)                     /*!< USB GINTSTS_DEVICEMODE: GOUTNakEff (Bit 7)                  */
#define USB_GINTSTS_DEVICEMODE_GOUTNakEff_Msk (0x80UL)                  /*!< USB GINTSTS_DEVICEMODE: GOUTNakEff (Bitfield-Mask: 0x01)    */
#define USB_GINTSTS_DEVICEMODE_ErlySusp_Pos   (10UL)                    /*!< USB GINTSTS_DEVICEMODE: ErlySusp (Bit 10)                   */
#define USB_GINTSTS_DEVICEMODE_ErlySusp_Msk   (0x400UL)                 /*!< USB GINTSTS_DEVICEMODE: ErlySusp (Bitfield-Mask: 0x01)      */
#define USB_GINTSTS_DEVICEMODE_USBSusp_Pos    (11UL)                    /*!< USB GINTSTS_DEVICEMODE: USBSusp (Bit 11)                    */
#define USB_GINTSTS_DEVICEMODE_USBSusp_Msk    (0x800UL)                 /*!< USB GINTSTS_DEVICEMODE: USBSusp (Bitfield-Mask: 0x01)       */
#define USB_GINTSTS_DEVICEMODE_USBRst_Pos     (12UL)                    /*!< USB GINTSTS_DEVICEMODE: USBRst (Bit 12)                     */
#define USB_GINTSTS_DEVICEMODE_USBRst_Msk     (0x1000UL)                /*!< USB GINTSTS_DEVICEMODE: USBRst (Bitfield-Mask: 0x01)        */
#define USB_GINTSTS_DEVICEMODE_EnumDone_Pos   (13UL)                    /*!< USB GINTSTS_DEVICEMODE: EnumDone (Bit 13)                   */
#define USB_GINTSTS_DEVICEMODE_EnumDone_Msk   (0x2000UL)                /*!< USB GINTSTS_DEVICEMODE: EnumDone (Bitfield-Mask: 0x01)      */
#define USB_GINTSTS_DEVICEMODE_ISOOutDrop_Pos (14UL)                    /*!< USB GINTSTS_DEVICEMODE: ISOOutDrop (Bit 14)                 */
#define USB_GINTSTS_DEVICEMODE_ISOOutDrop_Msk (0x4000UL)                /*!< USB GINTSTS_DEVICEMODE: ISOOutDrop (Bitfield-Mask: 0x01)    */
#define USB_GINTSTS_DEVICEMODE_EOPF_Pos       (15UL)                    /*!< USB GINTSTS_DEVICEMODE: EOPF (Bit 15)                       */
#define USB_GINTSTS_DEVICEMODE_EOPF_Msk       (0x8000UL)                /*!< USB GINTSTS_DEVICEMODE: EOPF (Bitfield-Mask: 0x01)          */
#define USB_GINTSTS_DEVICEMODE_IEPInt_Pos     (18UL)                    /*!< USB GINTSTS_DEVICEMODE: IEPInt (Bit 18)                     */
#define USB_GINTSTS_DEVICEMODE_IEPInt_Msk     (0x40000UL)               /*!< USB GINTSTS_DEVICEMODE: IEPInt (Bitfield-Mask: 0x01)        */
#define USB_GINTSTS_DEVICEMODE_OEPInt_Pos     (19UL)                    /*!< USB GINTSTS_DEVICEMODE: OEPInt (Bit 19)                     */
#define USB_GINTSTS_DEVICEMODE_OEPInt_Msk     (0x80000UL)               /*!< USB GINTSTS_DEVICEMODE: OEPInt (Bitfield-Mask: 0x01)        */
#define USB_GINTSTS_DEVICEMODE_incompISOIN_Pos (20UL)                   /*!< USB GINTSTS_DEVICEMODE: incompISOIN (Bit 20)                */
#define USB_GINTSTS_DEVICEMODE_incompISOIN_Msk (0x100000UL)             /*!< USB GINTSTS_DEVICEMODE: incompISOIN (Bitfield-Mask: 0x01)   */
#define USB_GINTSTS_DEVICEMODE_incomplSOOUT_Pos (21UL)                  /*!< USB GINTSTS_DEVICEMODE: incomplSOOUT (Bit 21)               */
#define USB_GINTSTS_DEVICEMODE_incomplSOOUT_Msk (0x200000UL)            /*!< USB GINTSTS_DEVICEMODE: incomplSOOUT (Bitfield-Mask: 0x01)  */
#define USB_GINTSTS_DEVICEMODE_ConIDStsChng_Pos (28UL)                  /*!< USB GINTSTS_DEVICEMODE: ConIDStsChng (Bit 28)               */
#define USB_GINTSTS_DEVICEMODE_ConIDStsChng_Msk (0x10000000UL)          /*!< USB GINTSTS_DEVICEMODE: ConIDStsChng (Bitfield-Mask: 0x01)  */
#define USB_GINTSTS_DEVICEMODE_SessReqInt_Pos (30UL)                    /*!< USB GINTSTS_DEVICEMODE: SessReqInt (Bit 30)                 */
#define USB_GINTSTS_DEVICEMODE_SessReqInt_Msk (0x40000000UL)            /*!< USB GINTSTS_DEVICEMODE: SessReqInt (Bitfield-Mask: 0x01)    */
#define USB_GINTSTS_DEVICEMODE_WkUpInt_Pos    (31UL)                    /*!< USB GINTSTS_DEVICEMODE: WkUpInt (Bit 31)                    */
#define USB_GINTSTS_DEVICEMODE_WkUpInt_Msk    (0x80000000UL)            /*!< USB GINTSTS_DEVICEMODE: WkUpInt (Bitfield-Mask: 0x01)       */

