alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* --------------------------------  DSD_CH_IWCTR  -------------------------------- */
#define DSD_CH_IWCTR_NVALCNT_Pos              (0UL)                     /*!< DSD_CH IWCTR: NVALCNT (Bit 0)                               */
#define DSD_CH_IWCTR_NVALCNT_Msk              (0x3fUL)                  /*!< DSD_CH IWCTR: NVALCNT (Bitfield-Mask: 0x3f)                 */
#define DSD_CH_IWCTR_INTEN_Pos                (7UL)                     /*!< DSD_CH IWCTR: INTEN (Bit 7)                                 */
#define DSD_CH_IWCTR_INTEN_Msk                (0x80UL)                  /*!< DSD_CH IWCTR: INTEN (Bitfield-Mask: 0x01)                   */
#define DSD_CH_IWCTR_REPCNT_Pos               (8UL)                     /*!< DSD_CH IWCTR: REPCNT (Bit 8)                                */
#define DSD_CH_IWCTR_REPCNT_Msk               (0xf00UL)                 /*!< DSD_CH IWCTR: REPCNT (Bitfield-Mask: 0x0f)                  */
#define DSD_CH_IWCTR_REPVAL_Pos               (12UL)                    /*!< DSD_CH IWCTR: REPVAL (Bit 12)                               */
#define DSD_CH_IWCTR_REPVAL_Msk               (0xf000UL)                /*!< DSD_CH IWCTR: REPVAL (Bitfield-Mask: 0x0f)                  */
#define DSD_CH_IWCTR_NVALDIS_Pos              (16UL)                    /*!< DSD_CH IWCTR: NVALDIS (Bit 16)                              */
#define DSD_CH_IWCTR_NVALDIS_Msk              (0x3f0000UL)              /*!< DSD_CH IWCTR: NVALDIS (Bitfield-Mask: 0x3f)                 */
#define DSD_CH_IWCTR_IWS_Pos                  (23UL)                    /*!< DSD_CH IWCTR: IWS (Bit 23)                                  */
#define DSD_CH_IWCTR_IWS_Msk                  (0x800000UL)              /*!< DSD_CH IWCTR: IWS (Bitfield-Mask: 0x01)                     */
#define DSD_CH_IWCTR_NVALINT_Pos              (24UL)                    /*!< DSD_CH IWCTR: NVALINT (Bit 24)                              */
#define DSD_CH_IWCTR_NVALINT_Msk              (0x3f000000UL)            /*!< DSD_CH IWCTR: NVALINT (Bitfield-Mask: 0x3f)                 */

/* -------------------------------  DSD_CH_BOUNDSEL  ------------------------------ */
#define DSD_CH_BOUNDSEL_BOUNDARYL_Pos         (0UL)                     /*!< DSD_CH BOUNDSEL: BOUNDARYL (Bit 0)                          */
#define DSD_CH_BOUNDSEL_BOUNDARYL_Msk         (0xffffUL)                /*!< DSD_CH BOUNDSEL: BOUNDARYL (Bitfield-Mask: 0xffff)          */
#define DSD_CH_BOUNDSEL_BOUNDARYU_Pos         (16UL)                    /*!< DSD_CH BOUNDSEL: BOUNDARYU (Bit 16)                         */
#define DSD_CH_BOUNDSEL_BOUNDARYU_Msk         (0xffff0000UL)            /*!< DSD_CH BOUNDSEL: BOUNDARYU (Bitfield-Mask: 0xffff)          */

/* ---------------------------------  DSD_CH_RESM  -------------------------------- */
#define DSD_CH_RESM_RESULT_Pos                (0UL)                     /*!< DSD_CH RESM: RESULT (Bit 0)                                 */
#define DSD_CH_RESM_RESULT_Msk                (0xffffUL)                /*!< DSD_CH RESM: RESULT (Bitfield-Mask: 0xffff)                 */

/* ---------------------------------  DSD_CH_OFFM  -------------------------------- */
#define DSD_CH_OFFM_OFFSET_Pos                (0UL)                     /*!< DSD_CH OFFM: OFFSET (Bit 0)                                 */
#define DSD_CH_OFFM_OFFSET_Msk                (0xffffUL)                /*!< DSD_CH OFFM: OFFSET (Bitfield-Mask: 0xffff)                 */

/* ---------------------------------  DSD_CH_RESA  -------------------------------- */
#define DSD_CH_RESA_RESULT_Pos                (0UL)                     /*!< DSD_CH RESA: RESULT (Bit 0)                                 */
#define DSD_CH_RESA_RESULT_Msk                (0xffffUL)                /*!< DSD_CH RESA: RESULT (Bitfield-Mask: 0xffff)                 */

/* --------------------------------  DSD_CH_TSTMP  -------------------------------- */
#define DSD_CH_TSTMP_RESULT_Pos               (0UL)                     /*!< DSD_CH TSTMP: RESULT (Bit 0)                                */
#define DSD_CH_TSTMP_RESULT_Msk               (0xffffUL)                /*!< DSD_CH TSTMP: RESULT (Bitfield-Mask: 0xffff)                */
#define DSD_CH_TSTMP_CFMDCNT_Pos              (16UL)                    /*!< DSD_CH TSTMP: CFMDCNT (Bit 16)                              */
#define DSD_CH_TSTMP_CFMDCNT_Msk              (0xff0000UL)              /*!< DSD_CH TSTMP: CFMDCNT (Bitfield-Mask: 0xff)                 */
#define DSD_CH_TSTMP_NVALCNT_Pos              (24UL)                    /*!< DSD_CH TSTMP: NVALCNT (Bit 24)                              */
#define DSD_CH_TSTMP_NVALCNT_Msk              (0x3f000000UL)            /*!< DSD_CH TSTMP: NVALCNT (Bitfield-Mask: 0x3f)                 */

/* --------------------------------  DSD_CH_CGSYNC  ------------------------------- */
#define DSD_CH_CGSYNC_SDCOUNT_Pos             (0UL)                     /*!< DSD_CH CGSYNC: SDCOUNT (Bit 0)                              */
#define DSD_CH_CGSYNC_SDCOUNT_Msk             (0xffUL)                  /*!< DSD_CH CGSYNC: SDCOUNT (Bitfield-Mask: 0xff)                */
#define DSD_CH_CGSYNC_SDCAP_Pos               (8UL)                     /*!< DSD_CH CGSYNC: SDCAP (Bit 8)                                */
#define DSD_CH_CGSYNC_SDCAP_Msk               (0xff00UL)                /*!< DSD_CH CGSYNC: SDCAP (Bitfield-Mask: 0xff)                  */
#define DSD_CH_CGSYNC_SDPOS_Pos               (16UL)                    /*!< DSD_CH CGSYNC: SDPOS (Bit 16)                               */
#define DSD_CH_CGSYNC_SDPOS_Msk               (0xff0000UL)              /*!< DSD_CH CGSYNC: SDPOS (Bitfield-Mask: 0xff)                  */
#define DSD_CH_CGSYNC_SDNEG_Pos               (24UL)                    /*!< DSD_CH CGSYNC: SDNEG (Bit 24)                               */
#define DSD_CH_CGSYNC_SDNEG_Msk               (0xff000000UL)            /*!< DSD_CH CGSYNC: SDNEG (Bitfield-Mask: 0xff)                  */

/* -------------------------------  DSD_CH_RECTCFG  ------------------------------- */
#define DSD_CH_RECTCFG_RFEN_Pos               (0UL)                     /*!< DSD_CH RECTCFG: RFEN (Bit 0)                                */
#define DSD_CH_RECTCFG_RFEN_Msk               (0x1UL)                   /*!< DSD_CH RECTCFG: RFEN (Bitfield-Mask: 0x01)                  */
#define DSD_CH_RECTCFG_SSRC_Pos               (4UL)                     /*!< DSD_CH RECTCFG: SSRC (Bit 4)                                */
#define DSD_CH_RECTCFG_SSRC_Msk               (0x30UL)                  /*!< DSD_CH RECTCFG: SSRC (Bitfield-Mask: 0x03)                  */
#define DSD_CH_RECTCFG_SDVAL_Pos              (15UL)                    /*!< DSD_CH RECTCFG: SDVAL (Bit 15)                              */
#define DSD_CH_RECTCFG_SDVAL_Msk              (0x8000UL)                /*!< DSD_CH RECTCFG: SDVAL (Bitfield-Mask: 0x01)                 */
#define DSD_CH_RECTCFG_SGNCS_Pos              (30UL)                    /*!< DSD_CH RECTCFG: SGNCS (Bit 30)                              */
#define DSD_CH_RECTCFG_SGNCS_Msk              (0x40000000UL)            /*!< DSD_CH RECTCFG: SGNCS (Bitfield-Mask: 0x01)                 */
#define DSD_CH_RECTCFG_SGND_Pos               (31UL)                    /*!< DSD_CH RECTCFG: SGND (Bit 31)                               */
#define DSD_CH_RECTCFG_SGND_Msk               (0x80000000UL)            /*!< DSD_CH RECTCFG: SGND (Bitfield-Mask: 0x01)                  */


/* ================================================================================ */
/* ================          struct 'DAC' Position & Mask          ================ */
/* ================================================================================ */


/* -----------------------------------  DAC_ID  ----------------------------------- */
#define DAC_ID_MODR_Pos                       (0UL)                     /*!< DAC ID: MODR (Bit 0)                                        */
#define DAC_ID_MODR_Msk                       (0xffUL)                  /*!< DAC ID: MODR (Bitfield-Mask: 0xff)                          */
#define DAC_ID_MODT_Pos                       (8UL)                     /*!< DAC ID: MODT (Bit 8)                                        */
#define DAC_ID_MODT_Msk                       (0xff00UL)                /*!< DAC ID: MODT (Bitfield-Mask: 0xff)                          */
#define DAC_ID_MODN_Pos                       (16UL)                    /*!< DAC ID: MODN (Bit 16)                                       */
#define DAC_ID_MODN_Msk                       (0xffff0000UL)            /*!< DAC ID: MODN (Bitfield-Mask: 0xffff)                        */

