alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC4800_series/Include/XMC4800.h
/* ---------------------------------  PORT8_IOCR8  -------------------------------- */
#define PORT8_IOCR8_PC8_Pos                   (3UL)                     /*!< PORT8 IOCR8: PC8 (Bit 3)                                    */
#define PORT8_IOCR8_PC8_Msk                   (0xf8UL)                  /*!< PORT8 IOCR8: PC8 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR8_PC9_Pos                   (11UL)                    /*!< PORT8 IOCR8: PC9 (Bit 11)                                   */
#define PORT8_IOCR8_PC9_Msk                   (0xf800UL)                /*!< PORT8 IOCR8: PC9 (Bitfield-Mask: 0x1f)                      */
#define PORT8_IOCR8_PC10_Pos                  (19UL)                    /*!< PORT8 IOCR8: PC10 (Bit 19)                                  */
#define PORT8_IOCR8_PC10_Msk                  (0xf80000UL)              /*!< PORT8 IOCR8: PC10 (Bitfield-Mask: 0x1f)                     */
#define PORT8_IOCR8_PC11_Pos                  (27UL)                    /*!< PORT8 IOCR8: PC11 (Bit 27)                                  */
#define PORT8_IOCR8_PC11_Msk                  (0xf8000000UL)            /*!< PORT8 IOCR8: PC11 (Bitfield-Mask: 0x1f)                     */

/* ----------------------------------  PORT8_IN  ---------------------------------- */
#define PORT8_IN_P0_Pos                       (0UL)                     /*!< PORT8 IN: P0 (Bit 0)                                        */
#define PORT8_IN_P0_Msk                       (0x1UL)                   /*!< PORT8 IN: P0 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P1_Pos                       (1UL)                     /*!< PORT8 IN: P1 (Bit 1)                                        */
#define PORT8_IN_P1_Msk                       (0x2UL)                   /*!< PORT8 IN: P1 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P2_Pos                       (2UL)                     /*!< PORT8 IN: P2 (Bit 2)                                        */
#define PORT8_IN_P2_Msk                       (0x4UL)                   /*!< PORT8 IN: P2 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P3_Pos                       (3UL)                     /*!< PORT8 IN: P3 (Bit 3)                                        */
#define PORT8_IN_P3_Msk                       (0x8UL)                   /*!< PORT8 IN: P3 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P4_Pos                       (4UL)                     /*!< PORT8 IN: P4 (Bit 4)                                        */
#define PORT8_IN_P4_Msk                       (0x10UL)                  /*!< PORT8 IN: P4 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P5_Pos                       (5UL)                     /*!< PORT8 IN: P5 (Bit 5)                                        */
#define PORT8_IN_P5_Msk                       (0x20UL)                  /*!< PORT8 IN: P5 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P6_Pos                       (6UL)                     /*!< PORT8 IN: P6 (Bit 6)                                        */
#define PORT8_IN_P6_Msk                       (0x40UL)                  /*!< PORT8 IN: P6 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P7_Pos                       (7UL)                     /*!< PORT8 IN: P7 (Bit 7)                                        */
#define PORT8_IN_P7_Msk                       (0x80UL)                  /*!< PORT8 IN: P7 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P8_Pos                       (8UL)                     /*!< PORT8 IN: P8 (Bit 8)                                        */
#define PORT8_IN_P8_Msk                       (0x100UL)                 /*!< PORT8 IN: P8 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P9_Pos                       (9UL)                     /*!< PORT8 IN: P9 (Bit 9)                                        */
#define PORT8_IN_P9_Msk                       (0x200UL)                 /*!< PORT8 IN: P9 (Bitfield-Mask: 0x01)                          */
#define PORT8_IN_P10_Pos                      (10UL)                    /*!< PORT8 IN: P10 (Bit 10)                                      */
#define PORT8_IN_P10_Msk                      (0x400UL)                 /*!< PORT8 IN: P10 (Bitfield-Mask: 0x01)                         */
#define PORT8_IN_P11_Pos                      (11UL)                    /*!< PORT8 IN: P11 (Bit 11)                                      */
#define PORT8_IN_P11_Msk                      (0x800UL)                 /*!< PORT8 IN: P11 (Bitfield-Mask: 0x01)                         */
#define PORT8_IN_P12_Pos                      (12UL)                    /*!< PORT8 IN: P12 (Bit 12)                                      */
#define PORT8_IN_P12_Msk                      (0x1000UL)                /*!< PORT8 IN: P12 (Bitfield-Mask: 0x01)                         */
#define PORT8_IN_P13_Pos                      (13UL)                    /*!< PORT8 IN: P13 (Bit 13)                                      */
#define PORT8_IN_P13_Msk                      (0x2000UL)                /*!< PORT8 IN: P13 (Bitfield-Mask: 0x01)                         */
#define PORT8_IN_P14_Pos                      (14UL)                    /*!< PORT8 IN: P14 (Bit 14)                                      */
#define PORT8_IN_P14_Msk                      (0x4000UL)                /*!< PORT8 IN: P14 (Bitfield-Mask: 0x01)                         */
#define PORT8_IN_P15_Pos                      (15UL)                    /*!< PORT8 IN: P15 (Bit 15)                                      */
#define PORT8_IN_P15_Msk                      (0x8000UL)                /*!< PORT8 IN: P15 (Bitfield-Mask: 0x01)                         */

/* ---------------------------------  PORT8_PDR0  --------------------------------- */
#define PORT8_PDR0_PD0_Pos                    (0UL)                     /*!< PORT8 PDR0: PD0 (Bit 0)                                     */
#define PORT8_PDR0_PD0_Msk                    (0x7UL)                   /*!< PORT8 PDR0: PD0 (Bitfield-Mask: 0x07)                       */
#define PORT8_PDR0_PD1_Pos                    (4UL)                     /*!< PORT8 PDR0: PD1 (Bit 4)                                     */
#define PORT8_PDR0_PD1_Msk                    (0x70UL)                  /*!< PORT8 PDR0: PD1 (Bitfield-Mask: 0x07)                       */
#define PORT8_PDR0_PD2_Pos                    (8UL)                     /*!< PORT8 PDR0: PD2 (Bit 8)                                     */
#define PORT8_PDR0_PD2_Msk                    (0x700UL)                 /*!< PORT8 PDR0: PD2 (Bitfield-Mask: 0x07)                       */
#define PORT8_PDR0_PD3_Pos                    (12UL)                    /*!< PORT8 PDR0: PD3 (Bit 12)                                    */
#define PORT8_PDR0_PD3_Msk                    (0x7000UL)                /*!< PORT8 PDR0: PD3 (Bitfield-Mask: 0x07)                       */
#define PORT8_PDR0_PD4_Pos                    (16UL)                    /*!< PORT8 PDR0: PD4 (Bit 16)                                    */
#define PORT8_PDR0_PD4_Msk                    (0x70000UL)               /*!< PORT8 PDR0: PD4 (Bitfield-Mask: 0x07)                       */
#define PORT8_PDR0_PD5_Pos                    (20UL)                    /*!< PORT8 PDR0: PD5 (Bit 20)                                    */
#define PORT8_PDR0_PD5_Msk                    (0x700000UL)              /*!< PORT8 PDR0: PD5 (Bitfield-Mask: 0x07)                       */
#define PORT8_PDR0_PD6_Pos                    (24UL)                    /*!< PORT8 PDR0: PD6 (Bit 24)                                    */
#define PORT8_PDR0_PD6_Msk                    (0x7000000UL)             /*!< PORT8 PDR0: PD6 (Bitfield-Mask: 0x07)                       */
#define PORT8_PDR0_PD7_Pos                    (28UL)                    /*!< PORT8 PDR0: PD7 (Bit 28)                                    */
#define PORT8_PDR0_PD7_Msk                    (0x70000000UL)            /*!< PORT8 PDR0: PD7 (Bitfield-Mask: 0x07)                       */

